{"bill":{"bill_id":1650920,"change_hash":"58ea025bb663e57f7cd2af8804ab9914","session_id":2041,"session":{"session_id":2041,"state_id":52,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"118th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB21\/2023","state_link":"https:\/\/www.congress.gov\/bill\/118th-congress\/house-bill\/21\/all-info","completed":0,"status":2,"status_date":"2023-01-30","progress":[{"date":"2023-01-09","event":1},{"date":"2023-01-09","event":9},{"date":"2023-01-30","event":2}],"state":"US","state_id":52,"bill_number":"HB21","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"S","current_body_id":115,"title":"Strategic Production Response Act","description":"To provide for the development of a plan to increase oil and gas production under oil and gas leases of Federal lands under the jurisdiction of the Secretary of Agriculture, the Secretary of Energy, the Secretary of the Interior, and the Secretary of Defense in conjunction with a drawdown of petroleum reserves from the Strategic Petroleum Reserve.","pending_committee_id":2324,"committee":{"committee_id":2324,"chamber":"S","chamber_id":115,"name":"Energy And Natural Resources"},"referrals":[{"date":"2023-01-09","committee_id":2302,"chamber":"H","chamber_id":114,"name":"Energy And Commerce"},{"date":"2023-01-30","committee_id":2324,"chamber":"S","chamber_id":115,"name":"Energy And Natural Resources"}],"history":[{"date":"2023-01-09","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-09","action":"Referred to the House Committee on Energy and Commerce.","chamber":"H","chamber_id":114,"importance":1},{"date":"2023-01-26","action":"Considered under the provisions of rule H. Res. 5.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 5 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"The Speaker designated the Honorable David Rouzer to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 21.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.2 Amendment (A001) offered by Mr. Gaetz. (consideration: CR H362-363; text: CR H362)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gaetz amendment No. 1 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.2 On agreeing to the Gaetz amendment (A001) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.3 Amendment (A002) offered by Mr. Pallone. (consideration: CR H363, H387; text: CR H363)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Pallone amendment No. 104 under the five-minute rule, pending the reservation of a point of order. Subsequently the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Pallone amendment No. 104, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.4 Amendment (A003) offered by Ms. Mace. (consideration: CR H363-364, H387-388; text: CR H363)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Mace amendment No. 133 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Mace amendment No. 133, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.5 Amendment (A004) offered by Ms. Castor (FL). (consideration: CR H364-365, H386-387; text: CR H364)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Castor (FL) amendment No. 3 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Castor (FL) amendment No. 3, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Castor (FL) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.6 Amendment (A005) offered by Mrs. Greene (GA). (consideration: CR H365-366, H388-389; text: CR H365)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Greene (GA) amendment No. 2 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Greene (GA) amendment No. 2, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.7 Amendment (A006) offered by Ms. Blunt Rochester. (consideration: CR H366, H386; text: CR H366)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Blunt Rochester amendment No. 71 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Blunt Rochester amendment No. 71, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Blunt Rochester demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.8 Amendment (A007) offered by Mr. LaLota. (consideration: CR H366-367; text: CR H366)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the LaLota amendment No. 143 under the five-minute rule, pending a reservation of a point of order, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.8 On agreeing to the LaLota amendment (A007) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.9 Amendment (A008) offered by Mr. Cleaver. (consideration: CR H367; text: CR H367)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cleaver amendment No. 8 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.9 On agreeing to the Cleaver amendment (A008) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.10 Amendment (A009) offered by Mr. Clyde. (consideration: CR H367; text: CR H367)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Clyde amendment No. 91 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.10 On agreeing to the Clyde amendment (A009) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.11 Amendment (A010) offered by Mr. Cleaver. (consideration: CR H367-368; text: CR H367)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cleaver amendment No. 9 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.11 On agreeing to the Cleaver amendment (A010) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.12 Amendment (A011) offered by Mrs. Boebert. (consideration: CR H368; text: CR H368)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 32 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.12 On agreeing to the Boebert amendment (A011) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.13 Amendment (A012) offered by Mr. Soto. (consideration: CR H368-369, H389; text: CR H368)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Soto amendment No. 44 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Soto amendment No. 44, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Soto demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.14 Amendment (A013) offered by Mrs. Boebert. (consideration: CR H369-370, H389-390; text: CR H369)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 33 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 33, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.15 Amendment (A014) offered by Ms. Spanberger. (consideration: CR H370-371, H390-391; text: CR H370)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Spanberger amendment No. 29 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Spanberger amendment No. 29, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Spanberger demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.16 Amendment (A015) offered by Mrs. Boebert. (consideration: CR H371-372; text: CR H371)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 137 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.16 On agreeing to the Boebert amendment (A015) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.17 Amendment (A016) offered by Ms. Tlaib. (consideration: CR H372; text: CR H372)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 10 under the five-minute rule, pending a reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.17 Mr. Johnson (OH) raised a point of order against the Tlaib amendment (A016). Mr. Johnson stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.18 Amendment (A017) offered by Mr. Perry. (consideration: CR H372-373; text: CR H372)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Perry amendment No. 41 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.18 On agreeing to the Perry amendment (A017) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.19 Amendment (A018) offered by Ms. Tlaib. (consideration: CR H373, H385; text: CR H373)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 11 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Tlaib amendment No. 11, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Tlaib demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.20 Amendment (A019) offered by Mr. Huffman. (consideration: CR H373-374, H391; text: CR H373)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Huffman amendment No. 15 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Huffman amendment No. 15, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Huffman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.21 Amendment (A020) offered by Mr. Huffman. (consideration: CR H374-375, H391-392; text: CR H374)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Huffman amendment No. 15 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Huffman amendment No. 65, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Huffman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.22 Amendment (A021) offered by Mr. Panetta. (consideration: CR H375, H392-393; text: CR H375)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Panetta amendment No. 26 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Panetta amendment No. 26, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Panetta demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.23 Amendment (A022) offered by Mr. Levin. (consideration: CR H375-376, H393; text: CR H375)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Levin amendment No. 18 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTONED PROCEEDINGS - At the conclusion of debate on the Levin amendment No. 18, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Levin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.24 Amendment (A023) offered by Ms. DelBene. (consideration: CR H376-377, H393-394; text: CR H376)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the DelBene amendment No. 7 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the DelBene amendment No. 7, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. DelBene demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.25 Amendment (A024) offered by Mr. Barr. (consideration: CR H377-378; text: CR H377)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Barr amendment No. 48 under the five-minute rule, pending the reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.25 Mr. Pallone raised a point of order against the Barr amendment (A024). Mr. Pallone raised a point of order against the Barr amendment. Mr. Pallone stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.26 Amendment (A025) offered by Mr. Levin. (consideration: CR H378, H394-395; text: CR H378)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Levin amendment No. 21 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Grijalva amendment No. 55, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Levin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.27 Amendment (A026) offered by Mr. Grijalva. (consideration: CR H378-379, H395; text: CR H378)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 55 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Grijalva amendment No. 55, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.28 Amendment (A027) offered by Mr. Grijalva. (consideration: CR H379, H395-396; text: CR H379)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 56 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Grijalva amendment No. 56, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.29 Amendment (A028) offered by Mr. Grijalva. (consideration: CR H379-380, H396-397; text: CR H379)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 57 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Grijalva amendment No. 57, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.30 Amendment (A029) offered by Mr. Thompson (CA). (consideration: CR H380; text: CR H380)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Thompson (CA) amendment No. 23 under the five-minute rule, pending a reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.30 Mr. Walberg raised a point of order against the Thompson (CA) amendment (A029). Mr. Walberg stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.31 Amendment (A030) offered by Ms. DeGette. (consideration: CR H380-381, H397; text: CR H380)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the DeGette amendment No. 89 under the five-minute rule, pending a reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.31 Mr. Walberg raised a point of order against the DeGette amendment (A030). Mr. Walberg raised a point of order against the DeGette amendment. Mr. Walberg stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the DeGette amendment No. 89, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. DeGette demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.32 Amendment (A031) offered by Mrs. Torres (CA). (consideration: CR H381-382, H397-398; text: CR H381)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Torres (CA) amendment No. 50 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Torres (CA) amendment No. 50, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mrs. Torres (CA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.33 Amendment (A032) offered by Mr. Gottheimer. (consideration: CR H382-383, H397-398; text: CR H382)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gottheimer amendment No. 85 under the five-minute rule, pending a reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.33 Mr. Carter (GA) raised a point of order against the Gottheimer amendment (A032). Mr. Carter (GA) stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gottheimer amendment No. 85, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Gottheimer demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.34 Amendment (A033) offered by Mr. Gottheimer. (consideration: CR H383, H399; text: CR H383)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gottheimer amendment No. 86 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gottheimer amendment No. 86, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Carter (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.35 Amendment (A034) offered by Mr. Cohen. (consideration: CR H383-384, H399-400; text: CR H383)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cohen amendment No. 129 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Cohen amendment No. 129, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Cohen demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.36 Amendment (A035) offered by Mr. Garcia, Robert. (consideration: CR H384-385, H400-401; text: CR H384)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Robert Garcia (CA) amendment No. 53 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Robert Garcia (CA) amendment No.53, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Carter (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.19 On agreeing to the Tlaib amendment (A018) Failed by recorded vote: 205 - 220 (Roll no. 37).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.7 On agreeing to the Blunt Rochester amendment (A006) Failed by recorded vote: 213 - 218 (Roll no. 38).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.5 On agreeing to the Castor (FL) amendment (A004) Failed by recorded vote: 214 - 219 (Roll no. 39).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.3 On agreeing to the Pallone amendment (A002) Failed by recorded vote: 214 - 219 (Roll no. 40).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.4 On agreeing to the Mace amendment (A003) Agreed to by recorded vote: 389 - 42 (Roll no. 41).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.6 On agreeing to the Greene (GA) amendment (A005) Failed by recorded vote: 14 - 418 (Roll no. 42).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.13 On agreeing to the Soto amendment (A012) Failed by recorded vote: 213 - 218 (Roll no. 43).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.14 On agreeing to the Boebert amendment (A013) Agreed to by recorded vote: 220 - 212 (Roll no. 44).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.15 On agreeing to the Spanberger amendment (A014) Failed by recorded vote: 213 - 218 (Roll no. 45).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.20 On agreeing to the Huffman amendment (A019) Failed by recorded vote: 212 - 218 (Roll no. 46).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.21 On agreeing to the Huffman amendment (A020) Failed by recorded vote: 205 - 225 (Roll no. 47).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.22 On agreeing to the Panetta amendment (A021) Failed by recorded vote: 213 - 218 (Roll no. 48).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.23 On agreeing to the Levin amendment (A022) Failed by recorded vote: 213 - 218 (Roll no. 49).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.24 On agreeing to the DelBene amendment (A023) Failed by recorded vote: 213 - 219 (Roll no. 50).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.26 On agreeing to the Levin amendment (A025) Failed by recorded vote: 210 - 222 (Roll no. 51).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.27 On agreeing to the Grijalva amendment (A026) Failed by recorded vote: 213 - 219 (Roll no. 52).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.28 On agreeing to the Grijalva amendment (A027) Failed by recorded vote: 213 - 219 (Roll no. 53).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.29 On agreeing to the Grijalva amendment (A028) Failed by recorded vote: 197 - 235 (Roll no. 54).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.31 On agreeing to the DeGette amendment (A030) Failed by recorded vote: 212 - 220 (Roll no. 55).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.32 On agreeing to the Torres (CA) amendment (A031) Failed by recorded vote: 204 - 228 (Roll no. 56).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.33 On agreeing to the Gottheimer amendment (A032) Agreed to by recorded vote: 419 - 13 (Roll no. 57).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.34 On agreeing to the Gottheimer amendment (A033) Agreed to by recorded vote: 418 - 12 (Roll no. 58).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.35 On agreeing to the Cohen amendment (A034) Failed by recorded vote: 199 - 232 (Roll no. 59).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.36 On agreeing to the Garcia, Robert amendment (A035) Failed by recorded vote: 199 - 230 (Roll no. 60).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.37 Amendment (A036) offered by Ms. Lee (CA). (consideration: CR H401-402; text: CR H401)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Lee (CA) amendment No. 84 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Lee (CA) amendment No. 84, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.38 Amendment (A037) offered by Mr. Payne. (consideration: CR H402-403; text: CR H402)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Payne amendment No. 76 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Payne amendment No. 76, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Payne demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.39 Amendment (A038) offered by Mr. Magaziner. (consideration: CR H403; text: CR H403)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Magaziner amendment No. 59 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Magaziner amendment No. 59, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Magaziner demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.40 Amendment (A039) offered by Mr. Magaziner. (consideration: CR H403-404; text: CR H403)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Magaziner amendment No. 58 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Magaziner amendment No. 58, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Magaziner demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.41 Amendment (A040) offered by Mr. Goldman (NY). (consideration: CR H404-405; text: CR H404)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Goldman (NY) amendment No. 16 under the five-minute rule, pending a reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.41 Mr. Duncan raised a point of order against the Goldman (NY) amendment (A040). Mr. Duncan stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.42 Amendment (A041) offered by Ms. Ocasio-Cortez. (consideration: CR H405; text: CR H405)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ocasio-Cortez amendment No. 74 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ocasio-Cortez amendment No. 74, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ocasio-Cortez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.43 Amendment (A042) offered by Ms. Ocasio-Cortez. (consideration: CR H405-406; text: CR H405)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ocasio-Cortez amendment No. 72 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ocasio-Cortez amendment No. 72, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ocasio-Cortez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.44 Amendment (A043) offered by Ms. Ocasio-Cortez. (consideration: CR H406-407; text: CR H406)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ocasio-Cortez amendment No. 73 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ocasio-Cortez amendment No. 73, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ocasio-Cortez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.45 Amendment (A044) offered by Ms. Jackson Lee. (consideration: CR H407; text: CR H407)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Jackson Lee amendment No. 35 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson Lee amendment No. 35, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.46 Amendment (A045) offered by Ms. Jackson Lee. (consideration: CR H407-408; text: CR H407)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Jackson Lee amendment No. 36 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson Lee amendment No. 36, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.47 Amendment (A046) offered by Ms. Ross. (consideration: CR H408-409; text: CR H408)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ross amendment No. 70 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ross amendment No. 70, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ross demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.48 Amendment (A047) offered by Mr. Casten. (consideration: CR H409-410; text: CR H409)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Casten amendment No. 66 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Casten amendment No. 66, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Weber (TX) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.49 Amendment (A048) offered by Mr. Casten. (consideration: CR H410; text: CR H410)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Casten amendment No. 67 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Casten amendment No. 67, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Casten demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.50 Amendment (A049) offered by Mr. Casten. (consideration: CR H410-411; text: CR H410)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Casten amendment No. 68 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Casten amendment No. 68, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Casten demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.51 Amendment (A050) offered by Ms. Wasserman Schultz. (consideration: CR H411; text: CR H411)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Wasserman Schultz amendment No. 75 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Wasserman Schultz amendment No. 75, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Wasserman Schultz demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.52 Amendment (A051) offered by Mr. Schneider. (consideration: CR H411-412; text: CR H411)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Schneider amendment No. 131 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Schneider amendment No. 131, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Schneider demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.53 Amendment (A052) offered by Ms. Manning. (consideration: CR H412; text: CR H412)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Manning amendment No. 27 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Manning amendment No. 27, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Manning demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.54 Amendment (A053) offered by Ms. Scholten. (consideration: CR H412-413; text: CR H412)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Scholten amendment No. 60 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Scholten amendment No. 60, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Weber (TX) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.55 Amendment (A054) offered by Mrs. Lee (NV). (consideration: CR H413; text: CR H413)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Lee (NV) amendment No. 25 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Lee (NV) amendment No. 25, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mrs. Lee (NV) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.56 Amendment (A055) offered by Ms. Porter. (consideration: CR H413-414; text: CR H413)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Porter amendment No. 45 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Porter amendment No. 45, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Porter demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.57 Amendment (A056) offered by Mr. Vasquez. (consideration: CR H414; text: CR H414)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Vasquez amendment No. 63 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Vasquez amendment No. 63, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Vasquez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.58 Amendment (A057) offered by Mr. Vasquez. (consideration: CR H414-415; text: CR H414)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Vasquez amendment No. 64 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Vasquez amendment No. 64, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Vasquez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.59 Amendment (A058) offered by Mr. Cicilline. (consideration: CR H415; text: CR H415)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cicilline amendment No. 135 under the five-minute rule. Pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Cicilline amendment No. 135, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Armstrong demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.60 Amendment (A059) offered by Mr. Quigley. (consideration: CR H416; text: CR H416)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Quigley amendment No. 125 under the five-minute rule. Pending the reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.60 Mr. Armstrong raised a point of order against the Quigley amendment (A059). Mr. Armstrong stated the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.61 Amendment (A060) offered by Mr. Takano. (consideration: CR H416-417; text: CR H416)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Takano amendment No. 80 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.61 On agreeing to the Takano amendment (A060) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.62 Amendment (A061) offered by Mr. Takano. (consideration: CR H417; text: CR H417)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Takano amendment No. 81 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Takano amendment No. 81, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Takano demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.63 Amendment (A062) offered by Mr. Takano. (consideration: CR H417-418; text: CR H417)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Takano amendment No. 82 under the five-minute rule. Pending the reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.63 Mr. Armstrong raised a point of order against the Takano amendment (A062). Mr. Armstrong stated the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.63 On agreeing to the Takano amendment (A062) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.64 Amendment (A063) offered by Mr. Castro (TX). (consideration: CR H418-419; text: CR H418)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Castro (TX) amendment No. 4 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Castro (TX) amendment No. 4, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Castro (TX) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.65 Amendment (A064) offered by Ms. Barragan. (consideration: CR H419; text: CR H419)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Barragan amendment No. 24 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Barragan amendment No. 24, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Barragan demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.66 Amendment (A065) offered by Ms. Plaskett. (consideration: CR H419-420; text: CR H419)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Plaskett amendment No. 43 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Plaskett amendment No. 43, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Plaskett demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.67 Amendment (A066) offered by Ms. Perez. (consideration: CR H420; text: CR H420)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Perez amendment No. 79 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perez amendment No. 79, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Perez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.68 Amendment (A067) offered by Mr. Bowman. (consideration: CR H420-421; text: CR H420)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Bowman amendment No. 92 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Bowman amendment No. 92, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Bowman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.69 Amendment (A068) offered by Ms. Tlaib. (consideration: CR H421; text: CR H421)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 13 under the five-minute rule. Pending the reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.69 Mr. Armstrong raised a point of order against the Tlaib amendment (A068). Mr. Armstrong stated the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.70 Amendment (A069) offered by Ms. Tlaib. (consideration: CR H421; text: CR H421)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 14 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"H.Amdt.70 On agreeing to the Tlaib amendment (A069) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"Mr. Armstrong moved that the Committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"On motion that the Committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-26","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 21 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.71 Amendment (A070) offered by Mr. Grijalva. (consideration: CR H435-436, H467-468; text: CR H435-436)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 145 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Grijalva amendment No. 145, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.72 Amendment (A071) offered by Mr. Jackson (NC). (consideration: CR H436-437, H468; text: CR H436)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Jackson (NC) amendment No. 46 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Jackson (NC) amendment No. 46, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.73 Amendment (A072) offered by Ms. Greene (GA). (consideration: CR H437-438; text: CR H437)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Greene (GA) amendment No. 147 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.73 On agreeing to the Greene (GA) amendment (A072) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.74 Amendment (A073) offered by Mr. Sherman. (consideration: CR H438-439; text: CR H438)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Sherman amendment No. 88 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.74 On agreeing to the Sherman amendment (A073) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.75 Amendment (A074) offered by Ms. Greene (GA). (consideration: CR H439-440; text: CR H439)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Sherman amendment No. 88 under the five-minute rule, pending a reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.75 Mr. Pallone raised a point of order against the Greene (GA) amendment (A074). Mr. Pallone stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.75 On agreeing to the Greene (GA) amendment (A074) Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.76 Amendment (A075) offered by Mr. Lieu. (consideration: CR H440-441, H468-469; text: CR H440)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Lieu amendment No. 61 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Lieu amendment No. 61, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Lieu demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.77 Amendment (A076) offered by Mr. Lieu. (consideration: CR H441; text: CR H441)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Lieu amendment No. 62 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.77 On agreeing to the Lieu amendment (A076) Failed by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.78 Amendment (A077) offered by Mr. Nickel. (consideration: CR H441-442; text: CR H441)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Nickel amendment No. 77 under the five-minute rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Nickel amendment No. 77, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Nickel demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.79 Amendment (A078) offered by Mr. Pallone. (consideration: CR H442-448; text: CR H442-447)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"DEBATE - Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Pallone amendment No. 95 under the five-minute rule, pending a reservation of a point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.79 Mr. Duncan raised a point of order against the Pallone amendment (A078). Mr. Duncan stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.37 On agreeing to the Lee (CA) amendment (A036) Failed by recorded vote: 207 - 223 (Roll no. 61). (consideration: CR H449)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.38 On agreeing to the Payne amendment (A037) Failed by recorded vote: 211 - 217 (Roll no. 62). (consideration: CR H449-450)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.51 On agreeing to the Wasserman Schultz amendment (A050) Failed by recorded vote: 212 - 215 (Roll no. 63). (consideration: CR H450)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.52 On agreeing to the Schneider amendment (A051) Failed by recorded vote: 209 - 215 (Roll no. 64). (consideration: CR H450-451)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.39 On agreeing to the Magaziner amendment (A038) Failed by recorded vote: 204 - 222 (Roll no. 65). (consideration: CR H451-452)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.40 On agreeing to the Magaziner amendment (A039) Failed by recorded vote: 205 - 220 (Roll no. 66). (consideration: CR H452-453)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.42 On agreeing to the Ocasio-Cortez amendment (A041) Failed by recorded vote: 171 - 256 (Roll no. 67). (consideration: CR H453)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.43 On agreeing to the Ocasio-Cortez amendment (A042) Failed by recorded vote: 193 - 228 (Roll no. 68). (consideration: CR H453-454)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.44 On agreeing to the Ocasio-Cortez amendment (A043) Failed by recorded vote: 199 - 229 (Roll no. 69). (consideration: CR H454)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.45 On agreeing to the Jackson Lee amendment (A044) Failed by recorded vote: 205 - 224 (Roll no. 70). (consideration: CR H455)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.46 On agreeing to the Jackson Lee amendment (A045) Failed by recorded vote: 207 - 220 (Roll no. 71). (consideration: CR H455-456)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.47 On agreeing to the Ross amendment (A046) Failed by recorded vote: 212 - 218 (Roll no. 72). (consideration: CR H456-457)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.48 On agreeing to the Casten amendment (A047) Failed by recorded vote: 199 - 231 (Roll no. 73). (consideration: CR H457)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.49 On agreeing to the Casten amendment (A048) Failed by recorded vote: 195 - 229 (Roll no. 74). (consideration: CR H457-458)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.50 On agreeing to the Casten amendment (A049) Failed by recorded vote: 191 - 237 (Roll no. 75). (consideration: CR H458)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.53 On agreeing to the Manning amendment (A052) Failed by recorded vote: 206 - 220 (Roll no. 76). (consideration: CR H458-459)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.54 On agreeing to the Scholten amendment (A053) Failed by recorded vote: 207 - 221 (Roll no. 77). (consideration: CR H459-460)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.55 On agreeing to the Lee (NV) amendment (A054) Failed by recorded vote: 207 - 221 (Roll no. 78). (consideration: CR H460)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.56 On agreeing to the Porter amendment (A055) Failed by recorded vote: 173 - 256 (Roll no. 79). (consideration: CR H460-461)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.57 On agreeing to the Vasquez amendment (A056) Failed by recorded vote: 204 - 224 (Roll no. 80). (consideration: CR H461-462)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.58 On agreeing to the Vasquez amendment (A057) Failed by recorded vote: 187 - 240 (Roll no. 81). (consideration: CR H462)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.59 On agreeing to the Cicilline amendment (A058) Failed by recorded vote: 211 - 217 (Roll no. 82). (consideration: CR H462-463)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.62 On agreeing to the Takano amendment (A061) Failed by recorded vote: 208 - 221 (Roll no. 83). (consideration: CR H463-464)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.64 On agreeing to the Castro (TX) amendment (A063) Failed by recorded vote: 197 - 230 (Roll no. 84). (consideration: CR H464)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.65 On agreeing to the Barragan amendment (A064) Failed by recorded vote: 209 - 219 (Roll no. 85). (consideration: CR H464-465)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.66 On agreeing to the Plaskett amendment (A065) Failed by recorded vote: 209 - 221 (Roll no. 86). (consideration: CR H465-466)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.67 On agreeing to the Perez amendment (A066) Failed by recorded vote: 210 - 219 (Roll no. 87). (consideration: CR H466)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.68 On agreeing to the Bowman amendment (A067) Failed by recorded vote: 201 - 229 (Roll no. 88). (consideration: CR H466-467)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.71 On agreeing to the Grijalva amendment (A070) Failed by recorded vote: 210 - 218 (Roll no. 89).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.72 On agreeing to the Jackson (NC) amendment (A071) Failed by recorded vote: 210 - 220 (Roll no. 90). (consideration: CR H468)","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.76 On agreeing to the Lieu amendment (A075) Failed by recorded vote: 198 - 229 (Roll no. 91).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"H.Amdt.78 On agreeing to the Nickel amendment (A077) Failed by recorded vote: 207 - 222 (Roll no. 92).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 21.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"On passage Passed by the Yeas and Nays: 221 - 205 (Roll no. 93).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-27","action":"The Clerk was authorized to correct section numbers, punctuation, and cross references, and to make other necessary technical and conforming corrections in the engrossment of H.R. 21.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-01-30","action":"Received in the Senate and Read twice and referred to the Committee on Energy and Natural Resources.","chamber":"S","chamber_id":115,"importance":1}],"sponsors":[{"people_id":9193,"person_hash":"4p9iymg5","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Cathy McMorris Rodgers","first_name":"Cathy","middle_name":"","last_name":"McMorris Rodgers","suffix":"","nickname":"","district":"HD-WA-5","ftm_eid":2941046,"votesmart_id":3217,"opensecrets_id":"N00026314","knowwho_pid":199779,"ballotpedia":"Cathy_McMorris_Rodgers","bioguide_id":"M001159","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":11049,"person_hash":"tzdxxeto","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Jeff Duncan","first_name":"Jeff","middle_name":"","last_name":"Duncan","suffix":"","nickname":"","district":"HD-SC-3","ftm_eid":8045191,"votesmart_id":47967,"opensecrets_id":"N00030752","knowwho_pid":213970,"ballotpedia":"Jeff_Duncan_(South_Carolina)","bioguide_id":"D000615","sponsor_type_id":2,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":2233},{"people_id":9216,"person_hash":"lkizgzxc","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Robert Latta","first_name":"Robert","middle_name":"E.","last_name":"Latta","suffix":"","nickname":"","district":"HD-OH-5","ftm_eid":3428798,"votesmart_id":9926,"opensecrets_id":"N00012233","knowwho_pid":209172,"ballotpedia":"Bob_Latta","bioguide_id":"L000566","sponsor_type_id":2,"sponsor_order":3,"committee_sponsor":0,"committee_id":0,"state_federal":654},{"people_id":19436,"person_hash":"4ggjmoax","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"John Curtis","first_name":"John","middle_name":"","last_name":"Curtis","suffix":"","nickname":"","district":"HD-UT-3","ftm_eid":6444263,"votesmart_id":123390,"opensecrets_id":"N00041221","knowwho_pid":626323,"ballotpedia":"John_Curtis_(Utah)","bioguide_id":"C001114","sponsor_type_id":2,"sponsor_order":4,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20076,"person_hash":"yfzzetnh","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"John Joyce","first_name":"John","middle_name":"","last_name":"Joyce","suffix":"","nickname":"","district":"HD-PA-13","ftm_eid":44955073,"votesmart_id":178911,"opensecrets_id":"N00043242","knowwho_pid":659206,"ballotpedia":"John_Joyce_(Pennsylvania)","bioguide_id":"J000302","sponsor_type_id":2,"sponsor_order":5,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9274,"person_hash":"e9i9kjv8","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Brett Guthrie","first_name":"Brett","middle_name":"","last_name":"Guthrie","suffix":"","nickname":"","district":"HD-KY-2","ftm_eid":6573540,"votesmart_id":18829,"opensecrets_id":"N00029675","knowwho_pid":194385,"ballotpedia":"Brett_Guthrie","bioguide_id":"G000558","sponsor_type_id":2,"sponsor_order":6,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":11059,"person_hash":"ckst1sva","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Bill Johnson","first_name":"Bill","middle_name":"","last_name":"Johnson","suffix":"","nickname":"","district":"HD-OH-6","ftm_eid":17657550,"votesmart_id":120649,"opensecrets_id":"N00032088","knowwho_pid":287357,"ballotpedia":"Bill_Johnson_(Ohio)","bioguide_id":"J000292","sponsor_type_id":2,"sponsor_order":7,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9176,"person_hash":"cu7fgqvh","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Michael Burgess","first_name":"Michael","middle_name":"C.","last_name":"Burgess","suffix":"","nickname":"","district":"HD-TX-26","ftm_eid":17658442,"votesmart_id":50120,"opensecrets_id":"N00025219","knowwho_pid":211708,"ballotpedia":"Michael_Burgess","bioguide_id":"B001248","sponsor_type_id":2,"sponsor_order":8,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":14084,"person_hash":"m78r4asr","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Richard Hudson","first_name":"Richard","middle_name":"","last_name":"Hudson","suffix":"","nickname":"","district":"HD-NC-9","ftm_eid":6611759,"votesmart_id":136448,"opensecrets_id":"N00033630","knowwho_pid":161542,"ballotpedia":"Richard_Hudson","bioguide_id":"H001067","sponsor_type_id":2,"sponsor_order":9,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20096,"person_hash":"fkmxwvoo","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Guy Reschenthaler","first_name":"Guy","middle_name":"","last_name":"Reschenthaler","suffix":"","nickname":"","district":"HD-PA-14","ftm_eid":24650451,"votesmart_id":166004,"opensecrets_id":"N00041871","knowwho_pid":560660,"ballotpedia":"Guy_Reschenthaler","bioguide_id":"R000610","sponsor_type_id":2,"sponsor_order":10,"committee_sponsor":0,"committee_id":0,"state_federal":17726},{"people_id":18310,"person_hash":"mpcv1p4d","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Clay Higgins","first_name":"Clay","middle_name":"","last_name":"Higgins","suffix":"","nickname":"","district":"HD-LA-3","ftm_eid":41316479,"votesmart_id":174484,"opensecrets_id":"N00039953","knowwho_pid":588003,"ballotpedia":"Clay_Higgins","bioguide_id":"H001077","sponsor_type_id":2,"sponsor_order":11,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":21977,"person_hash":"udjuvnqs","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Scott Fitzgerald","first_name":"Scott","middle_name":"L.","last_name":"Fitzgerald","suffix":"","nickname":"","district":"HD-WI-5","ftm_eid":13013877,"votesmart_id":3446,"opensecrets_id":"N00045434","knowwho_pid":199880,"ballotpedia":"Scott_Fitzgerald","bioguide_id":"F000471","sponsor_type_id":2,"sponsor_order":12,"committee_sponsor":0,"committee_id":0,"state_federal":3920},{"people_id":18300,"person_hash":"pzu9xprp","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Neal Dunn","first_name":"Neal","middle_name":"P.","last_name":"Dunn","suffix":"","nickname":"","district":"HD-FL-2","ftm_eid":117671,"votesmart_id":166297,"opensecrets_id":"N00037442","knowwho_pid":547694,"ballotpedia":"Neal_Dunn","bioguide_id":"D000628","sponsor_type_id":2,"sponsor_order":13,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20040,"person_hash":"py56x01z","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Kelly Armstrong","first_name":"Kelly","middle_name":"","last_name":"Armstrong","suffix":"","nickname":"","district":"HD-ND","ftm_eid":11029961,"votesmart_id":139338,"opensecrets_id":"N00042868","knowwho_pid":411641,"ballotpedia":"Kelly_Armstrong","bioguide_id":"A000377","sponsor_type_id":2,"sponsor_order":14,"committee_sponsor":0,"committee_id":0,"state_federal":14244},{"people_id":9209,"person_hash":"nnqnietk","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Gus Bilirakis","first_name":"Gus","middle_name":"M.","last_name":"Bilirakis","suffix":"","nickname":"","district":"HD-FL-12","ftm_eid":12998704,"votesmart_id":17318,"opensecrets_id":"N00027462","knowwho_pid":193559,"ballotpedia":"Gus_Bilirakis","bioguide_id":"B001257","sponsor_type_id":2,"sponsor_order":15,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":11077,"person_hash":"t1xxilhf","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Tim Walberg","first_name":"Tim","middle_name":"","last_name":"Walberg","suffix":"","nickname":"","district":"HD-MI-5","ftm_eid":200642,"votesmart_id":8618,"opensecrets_id":"N00026368","knowwho_pid":248304,"ballotpedia":"Tim_Walberg","bioguide_id":"W000798","sponsor_type_id":2,"sponsor_order":16,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":11042,"person_hash":"q6aavo7l","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Larry Bucshon","first_name":"Larry","middle_name":"","last_name":"Bucshon","suffix":"","nickname":"","district":"HD-IN-8","ftm_eid":7004017,"votesmart_id":120335,"opensecrets_id":"N00031227","knowwho_pid":284631,"ballotpedia":"Larry_Bucshon","bioguide_id":"B001275","sponsor_type_id":2,"sponsor_order":17,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20092,"person_hash":"eazmksby","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Gregory Pence","first_name":"Gregory","middle_name":"J.","last_name":"Pence","suffix":"","nickname":"","district":"HD-IN-6","ftm_eid":44044678,"votesmart_id":177876,"opensecrets_id":"N00041956","knowwho_pid":640272,"ballotpedia":"Greg_Pence","bioguide_id":"P000615","sponsor_type_id":2,"sponsor_order":18,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20049,"person_hash":"v02baz57","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Dan Crenshaw","first_name":"Dan","middle_name":"","last_name":"Crenshaw","suffix":"","nickname":"","district":"HD-TX-2","ftm_eid":44449939,"votesmart_id":177270,"opensecrets_id":"N00042224","knowwho_pid":644108,"ballotpedia":"Daniel_Crenshaw","bioguide_id":"C001120","sponsor_type_id":2,"sponsor_order":19,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9389,"person_hash":"8gue0k26","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Robert Wittman","first_name":"Robert","middle_name":"J.","last_name":"Wittman","suffix":"","nickname":"","district":"HD-VA-1","ftm_eid":6666723,"votesmart_id":58133,"opensecrets_id":"N00029459","knowwho_pid":241260,"ballotpedia":"Rob_Wittman","bioguide_id":"W000804","sponsor_type_id":2,"sponsor_order":20,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":24031,"person_hash":"v9e6a71p","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Thomas Kean","first_name":"Thomas","middle_name":"H.","last_name":"Kean","suffix":"Jr.","nickname":"","district":"HD-NJ-7","ftm_eid":0,"votesmart_id":43250,"opensecrets_id":"","knowwho_pid":0,"ballotpedia":"Thomas_Kean_Jr.","bioguide_id":"K000398","sponsor_type_id":2,"sponsor_order":21,"committee_sponsor":0,"committee_id":0,"state_federal":3164},{"people_id":24039,"person_hash":"a7p72wxh","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Nicholas Langworthy","first_name":"Nicholas","middle_name":"A.","last_name":"Langworthy","suffix":"","nickname":"","district":"HD-NY-23","ftm_eid":0,"votesmart_id":208663,"opensecrets_id":"","knowwho_pid":0,"ballotpedia":"Nicholas_A._Langworthy","bioguide_id":"L000600","sponsor_type_id":2,"sponsor_order":22,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":24009,"person_hash":"uiyqdlif","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Lori Chavez-DeRemer","first_name":"Lori","middle_name":"","last_name":"Chavez-DeRemer","suffix":"","nickname":"","district":"HD-OR-5","ftm_eid":0,"votesmart_id":202792,"opensecrets_id":"","knowwho_pid":0,"ballotpedia":"Lori_Chavez-DeRemer","bioguide_id":"C001135","sponsor_type_id":2,"sponsor_order":23,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":21935,"person_hash":"21y0ga9h","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Marjorie Greene","first_name":"Marjorie","middle_name":"Taylor","last_name":"Greene","suffix":"","nickname":"","district":"HD-GA-14","ftm_eid":48161226,"votesmart_id":189785,"opensecrets_id":"N00044701","knowwho_pid":707878,"ballotpedia":"Marjorie_Taylor_Greene","bioguide_id":"G000596","sponsor_type_id":2,"sponsor_order":24,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":21961,"person_hash":"f7cd23g4","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Nicole Malliotakis","first_name":"Nicole","middle_name":"","last_name":"Malliotakis","suffix":"","nickname":"","district":"HD-NY-11","ftm_eid":13009241,"votesmart_id":127929,"opensecrets_id":"N00044040","knowwho_pid":309650,"ballotpedia":"Nicole_Malliotakis","bioguide_id":"M000317","sponsor_type_id":2,"sponsor_order":25,"committee_sponsor":0,"committee_id":0,"state_federal":11105},{"people_id":18287,"person_hash":"u4dxffng","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Don Bacon","first_name":"Don","middle_name":"","last_name":"Bacon","suffix":"","nickname":"","district":"HD-NE-2","ftm_eid":32158683,"votesmart_id":166299,"opensecrets_id":"N00037049","knowwho_pid":346086,"ballotpedia":"Don_Bacon","bioguide_id":"B001298","sponsor_type_id":2,"sponsor_order":26,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20047,"person_hash":"s8gvila1","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Ben Cline","first_name":"Ben","middle_name":"L.","last_name":"Cline","suffix":"","nickname":"","district":"HD-VA-6","ftm_eid":6613874,"votesmart_id":50959,"opensecrets_id":"N00042296","knowwho_pid":212955,"ballotpedia":"Ben_Cline","bioguide_id":"C001118","sponsor_type_id":2,"sponsor_order":27,"committee_sponsor":0,"committee_id":0,"state_federal":677},{"people_id":9279,"person_hash":"wchtw30t","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Darrell Issa","first_name":"Darrell","middle_name":"E.","last_name":"Issa","suffix":"","nickname":"","district":"HD-CA-48","ftm_eid":61054,"votesmart_id":16553,"opensecrets_id":"N00007017","knowwho_pid":205554,"ballotpedia":"Darrell_Issa","bioguide_id":"I000056","sponsor_type_id":2,"sponsor_order":28,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":24016,"person_hash":"8fipzkjy","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Chuck Edwards","first_name":"Charles","middle_name":"","last_name":"Edwards","suffix":"","nickname":"Chuck","district":"HD-NC-11","ftm_eid":0,"votesmart_id":166600,"opensecrets_id":"","knowwho_pid":0,"ballotpedia":"Chuck_Edwards","bioguide_id":"E000246","sponsor_type_id":2,"sponsor_order":29,"committee_sponsor":0,"committee_id":0,"state_federal":18062},{"people_id":22947,"person_hash":"9ltdxb73","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Jake Ellzey","first_name":"John","middle_name":"K.","last_name":"Ellzey","suffix":"Sr.","nickname":"Jake","district":"HD-TX-6","ftm_eid":22214513,"votesmart_id":68070,"opensecrets_id":"N00042243","knowwho_pid":533891,"ballotpedia":"Jake_Ellzey","bioguide_id":"E000071","sponsor_type_id":2,"sponsor_order":30,"committee_sponsor":0,"committee_id":0,"state_federal":22430},{"people_id":19676,"person_hash":"aii9kehb","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Troy Balderson","first_name":"Troy","middle_name":"","last_name":"Balderson","suffix":"","nickname":"","district":"HD-OH-12","ftm_eid":3499988,"votesmart_id":102781,"opensecrets_id":"N00042194","knowwho_pid":271784,"ballotpedia":"Troy_Balderson","bioguide_id":"B001306","sponsor_type_id":2,"sponsor_order":31,"committee_sponsor":0,"committee_id":0,"state_federal":850},{"people_id":16454,"person_hash":"8v83hjk6","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Earl Carter","first_name":"Earl","middle_name":"L.","last_name":"Carter","suffix":"","nickname":"Buddy","district":"HD-GA-1","ftm_eid":6806386,"votesmart_id":32085,"opensecrets_id":"N00035346","knowwho_pid":228474,"ballotpedia":"Earl_%22Buddy%22_Carter","bioguide_id":"C001103","sponsor_type_id":2,"sponsor_order":32,"committee_sponsor":0,"committee_id":0,"state_federal":1803},{"people_id":14922,"person_hash":"m6il9679","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Randy Weber","first_name":"Randy","middle_name":"K.","last_name":"Weber","suffix":"Sr.","nickname":"","district":"HD-TX-14","ftm_eid":13006857,"votesmart_id":102026,"opensecrets_id":"N00033539","knowwho_pid":269711,"ballotpedia":"Randy_Weber","bioguide_id":"W000814","sponsor_type_id":2,"sponsor_order":33,"committee_sponsor":0,"committee_id":0,"state_federal":5998},{"people_id":20108,"person_hash":"1zy2f82t","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Pete Stauber","first_name":"Pete","middle_name":"","last_name":"Stauber","suffix":"","nickname":"","district":"HD-MN-8","ftm_eid":44044791,"votesmart_id":159954,"opensecrets_id":"N00041511","knowwho_pid":630211,"ballotpedia":"Pete_Stauber","bioguide_id":"S001212","sponsor_type_id":2,"sponsor_order":34,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":11099,"person_hash":"wdolqnr4","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Steve Womack","first_name":"Steve","middle_name":"","last_name":"Womack","suffix":"","nickname":"","district":"HD-AR-3","ftm_eid":9604218,"votesmart_id":71815,"opensecrets_id":"N00031857","knowwho_pid":285713,"ballotpedia":"Steve_Womack","bioguide_id":"W000809","sponsor_type_id":2,"sponsor_order":35,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":21939,"person_hash":"zj18zmyg","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Ashley Hinson","first_name":"Ashley","middle_name":"E.","last_name":"Hinson","suffix":"","nickname":"","district":"HD-IA-2","ftm_eid":38148887,"votesmart_id":168783,"opensecrets_id":"N00044521","knowwho_pid":572935,"ballotpedia":"Ashley_Hinson","bioguide_id":"H001091","sponsor_type_id":2,"sponsor_order":36,"committee_sponsor":0,"committee_id":0,"state_federal":18956},{"people_id":21927,"person_hash":"h42uqcqf","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Lauren Boebert","first_name":"Lauren","middle_name":"","last_name":"Boebert","suffix":"","nickname":"","district":"HD-CO-3","ftm_eid":19528829,"votesmart_id":191290,"opensecrets_id":"N00045974","knowwho_pid":724132,"ballotpedia":"Lauren_Boebert","bioguide_id":"B000825","sponsor_type_id":2,"sponsor_order":37,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":24067,"person_hash":"5u3zr6ni","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Derrick Van Orden","first_name":"Derrick","middle_name":"","last_name":"Van Orden","suffix":"","nickname":"","district":"HD-WI-3","ftm_eid":0,"votesmart_id":192343,"opensecrets_id":"","knowwho_pid":0,"ballotpedia":"Derrick_Van_Orden","bioguide_id":"V000135","sponsor_type_id":2,"sponsor_order":38,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":21928,"person_hash":"6aoc44nq","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Kat Cammack","first_name":"Kat","middle_name":"","last_name":"Cammack","suffix":"","nickname":"","district":"HD-FL-3","ftm_eid":49284296,"votesmart_id":191306,"opensecrets_id":"N00045978","knowwho_pid":447426,"ballotpedia":"Kat_Cammack","bioguide_id":"C001039","sponsor_type_id":2,"sponsor_order":39,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9182,"person_hash":"xlecopz0","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Kay Granger","first_name":"Kay","middle_name":"","last_name":"Granger","suffix":"","nickname":"","district":"HD-TX-12","ftm_eid":17658723,"votesmart_id":334,"opensecrets_id":"N00008799","knowwho_pid":159082,"ballotpedia":"Kay_Granger","bioguide_id":"G000377","sponsor_type_id":2,"sponsor_order":40,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":9200,"person_hash":"69y137x9","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Pete Sessions","first_name":"Pete","middle_name":"","last_name":"Sessions","suffix":"","nickname":"","district":"HD-TX-17","ftm_eid":10838573,"votesmart_id":288,"opensecrets_id":"N00005681","knowwho_pid":159075,"ballotpedia":"Pete_Sessions","bioguide_id":"S000250","sponsor_type_id":2,"sponsor_order":41,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HB591","sast_bill_id":1685033},{"type_id":8,"type":"Related","sast_bill_number":"HR5","sast_bill_id":1650947}],"subjects":[{"subject_id":13399,"subject_name":"Energy"}],"texts":[{"doc_id":2630778,"date":"2023-01-10","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB21\/id\/2630778","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr21\/BILLS-118hr21ih.pdf","text_size":231743,"text_hash":"e47eb08871af8e903d5a38a7ef418c81","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":2671159,"date":"2023-01-30","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB21\/id\/2671159","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr21\/BILLS-118hr21eh.pdf","text_size":116397,"text_hash":"37352dcb2a67ec24d4cfa4fa555423c3","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""}],"votes":[{"roll_call_id":1236890,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":205,"nay":220,"nv":0,"absent":15,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236890","state_link":"https:\/\/clerk.house.gov\/Votes\/202337"},{"roll_call_id":1236891,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":218,"nv":0,"absent":9,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236891","state_link":"https:\/\/clerk.house.gov\/Votes\/202338"},{"roll_call_id":1236892,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":214,"nay":219,"nv":0,"absent":7,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236892","state_link":"https:\/\/clerk.house.gov\/Votes\/202339"},{"roll_call_id":1236893,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":214,"nay":219,"nv":0,"absent":7,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236893","state_link":"https:\/\/clerk.house.gov\/Votes\/202340"},{"roll_call_id":1236894,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":389,"nay":42,"nv":0,"absent":8,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236894","state_link":"https:\/\/clerk.house.gov\/Votes\/202341"},{"roll_call_id":1236895,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":14,"nay":418,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236895","state_link":"https:\/\/clerk.house.gov\/Votes\/202342"},{"roll_call_id":1236896,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":218,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236896","state_link":"https:\/\/clerk.house.gov\/Votes\/202343"},{"roll_call_id":1236897,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":220,"nay":212,"nv":0,"absent":7,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236897","state_link":"https:\/\/clerk.house.gov\/Votes\/202344"},{"roll_call_id":1236898,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":218,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236898","state_link":"https:\/\/clerk.house.gov\/Votes\/202345"},{"roll_call_id":1236899,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":212,"nay":218,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236899","state_link":"https:\/\/clerk.house.gov\/Votes\/202346"},{"roll_call_id":1236900,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":205,"nay":225,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236900","state_link":"https:\/\/clerk.house.gov\/Votes\/202347"},{"roll_call_id":1236901,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":218,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236901","state_link":"https:\/\/clerk.house.gov\/Votes\/202348"},{"roll_call_id":1236902,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":218,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236902","state_link":"https:\/\/clerk.house.gov\/Votes\/202349"},{"roll_call_id":1236903,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":219,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236903","state_link":"https:\/\/clerk.house.gov\/Votes\/202350"},{"roll_call_id":1236904,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":210,"nay":222,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236904","state_link":"https:\/\/clerk.house.gov\/Votes\/202351"},{"roll_call_id":1236905,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":219,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236905","state_link":"https:\/\/clerk.house.gov\/Votes\/202352"},{"roll_call_id":1236906,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":213,"nay":219,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236906","state_link":"https:\/\/clerk.house.gov\/Votes\/202353"},{"roll_call_id":1236907,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":197,"nay":235,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236907","state_link":"https:\/\/clerk.house.gov\/Votes\/202354"},{"roll_call_id":1236908,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":212,"nay":220,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236908","state_link":"https:\/\/clerk.house.gov\/Votes\/202355"},{"roll_call_id":1236909,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":204,"nay":228,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236909","state_link":"https:\/\/clerk.house.gov\/Votes\/202356"},{"roll_call_id":1236910,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":419,"nay":13,"nv":0,"absent":7,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236910","state_link":"https:\/\/clerk.house.gov\/Votes\/202357"},{"roll_call_id":1236911,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":418,"nay":12,"nv":0,"absent":9,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236911","state_link":"https:\/\/clerk.house.gov\/Votes\/202358"},{"roll_call_id":1236912,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":199,"nay":232,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236912","state_link":"https:\/\/clerk.house.gov\/Votes\/202359"},{"roll_call_id":1236913,"date":"2023-01-26","desc":"On Agreeing to the Amendment","yea":199,"nay":230,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1236913","state_link":"https:\/\/clerk.house.gov\/Votes\/202360"},{"roll_call_id":1237425,"date":"2023-01-27","desc":"On Passage","yea":221,"nay":205,"nv":0,"absent":8,"total":434,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237425","state_link":"https:\/\/clerk.house.gov\/Votes\/202393"},{"roll_call_id":1237754,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":207,"nay":223,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237754","state_link":"https:\/\/clerk.house.gov\/Votes\/202361"},{"roll_call_id":1237755,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":211,"nay":217,"nv":0,"absent":11,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237755","state_link":"https:\/\/clerk.house.gov\/Votes\/202362"},{"roll_call_id":1237756,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":212,"nay":215,"nv":0,"absent":13,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237756","state_link":"https:\/\/clerk.house.gov\/Votes\/202363"},{"roll_call_id":1237757,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":209,"nay":215,"nv":0,"absent":16,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237757","state_link":"https:\/\/clerk.house.gov\/Votes\/202364"},{"roll_call_id":1237758,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":204,"nay":222,"nv":0,"absent":14,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237758","state_link":"https:\/\/clerk.house.gov\/Votes\/202365"},{"roll_call_id":1237759,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":205,"nay":220,"nv":0,"absent":15,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237759","state_link":"https:\/\/clerk.house.gov\/Votes\/202366"},{"roll_call_id":1237760,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":171,"nay":256,"nv":0,"absent":12,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237760","state_link":"https:\/\/clerk.house.gov\/Votes\/202367"},{"roll_call_id":1237761,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":193,"nay":228,"nv":0,"absent":18,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237761","state_link":"https:\/\/clerk.house.gov\/Votes\/202368"},{"roll_call_id":1237762,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":199,"nay":229,"nv":0,"absent":11,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237762","state_link":"https:\/\/clerk.house.gov\/Votes\/202369"},{"roll_call_id":1237763,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":205,"nay":224,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237763","state_link":"https:\/\/clerk.house.gov\/Votes\/202370"},{"roll_call_id":1237764,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":207,"nay":220,"nv":0,"absent":12,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237764","state_link":"https:\/\/clerk.house.gov\/Votes\/202371"},{"roll_call_id":1237765,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":212,"nay":218,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237765","state_link":"https:\/\/clerk.house.gov\/Votes\/202372"},{"roll_call_id":1237766,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":199,"nay":231,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237766","state_link":"https:\/\/clerk.house.gov\/Votes\/202373"},{"roll_call_id":1237767,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":195,"nay":229,"nv":0,"absent":15,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237767","state_link":"https:\/\/clerk.house.gov\/Votes\/202374"},{"roll_call_id":1237768,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":191,"nay":237,"nv":0,"absent":11,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237768","state_link":"https:\/\/clerk.house.gov\/Votes\/202375"},{"roll_call_id":1237769,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":206,"nay":220,"nv":0,"absent":13,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237769","state_link":"https:\/\/clerk.house.gov\/Votes\/202376"},{"roll_call_id":1237770,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":207,"nay":221,"nv":0,"absent":11,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237770","state_link":"https:\/\/clerk.house.gov\/Votes\/202377"},{"roll_call_id":1237771,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":207,"nay":221,"nv":0,"absent":11,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237771","state_link":"https:\/\/clerk.house.gov\/Votes\/202378"},{"roll_call_id":1237772,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":173,"nay":256,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237772","state_link":"https:\/\/clerk.house.gov\/Votes\/202379"},{"roll_call_id":1237773,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":204,"nay":224,"nv":0,"absent":11,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237773","state_link":"https:\/\/clerk.house.gov\/Votes\/202380"},{"roll_call_id":1237774,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":187,"nay":240,"nv":0,"absent":12,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237774","state_link":"https:\/\/clerk.house.gov\/Votes\/202381"},{"roll_call_id":1237775,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":211,"nay":217,"nv":0,"absent":11,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237775","state_link":"https:\/\/clerk.house.gov\/Votes\/202382"},{"roll_call_id":1237776,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":208,"nay":221,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237776","state_link":"https:\/\/clerk.house.gov\/Votes\/202383"},{"roll_call_id":1237777,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":197,"nay":230,"nv":0,"absent":12,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237777","state_link":"https:\/\/clerk.house.gov\/Votes\/202384"},{"roll_call_id":1237778,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":209,"nay":219,"nv":0,"absent":12,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237778","state_link":"https:\/\/clerk.house.gov\/Votes\/202385"},{"roll_call_id":1237779,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":209,"nay":221,"nv":0,"absent":10,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237779","state_link":"https:\/\/clerk.house.gov\/Votes\/202386"},{"roll_call_id":1237780,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":210,"nay":219,"nv":0,"absent":11,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237780","state_link":"https:\/\/clerk.house.gov\/Votes\/202387"},{"roll_call_id":1237781,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":201,"nay":229,"nv":0,"absent":10,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237781","state_link":"https:\/\/clerk.house.gov\/Votes\/202388"},{"roll_call_id":1237782,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":210,"nay":218,"nv":0,"absent":12,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237782","state_link":"https:\/\/clerk.house.gov\/Votes\/202389"},{"roll_call_id":1237783,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":210,"nay":220,"nv":0,"absent":10,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237783","state_link":"https:\/\/clerk.house.gov\/Votes\/202390"},{"roll_call_id":1237784,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":198,"nay":229,"nv":0,"absent":13,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237784","state_link":"https:\/\/clerk.house.gov\/Votes\/202391"},{"roll_call_id":1237785,"date":"2023-01-27","desc":"On Agreeing to the Amendment","yea":207,"nay":222,"nv":0,"absent":11,"total":440,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB21\/id\/1237785","state_link":"https:\/\/clerk.house.gov\/Votes\/202392"}],"amendments":[],"supplements":[],"calendar":[]}}