{"bill":{"bill_id":1773272,"change_hash":"9c50bf320133e681c3624b6f867709ce","session_id":2041,"session":{"session_id":2041,"state_id":52,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"118th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB4367\/2023","state_link":"https:\/\/www.congress.gov\/bill\/118th-congress\/house-bill\/4367\/all-info","completed":0,"status":1,"status_date":"2023-06-27","progress":[{"date":"2023-06-27","event":1}],"state":"US","state_id":52,"bill_number":"HB4367","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"H","current_body_id":114,"title":"Department of Homeland Security Appropriations Act, 2024","description":"Making appropriations for the Department of Homeland Security for the fiscal year ending September 30, 2024, and for other purposes.","pending_committee_id":0,"committee":[],"referrals":[],"history":[{"date":"2023-06-27","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-27","action":"The House Committee on Appropriations reported an original measure, H. Rept. 118-123, by Mr. Joyce (OH).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-27","action":"Placed on the Union Calendar, Calendar No. 95.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"Rules Committee Resolution H. Res. 723 Reported to House. Rule provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368 and H.R. 4665. The resolution provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368, and H.R. 4665, under a structured rule for each bill. The resolution provides for one hour of general debate for each bill and one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Considered under the provisions of rule H. Res. 723.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Rule provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368 and H.R. 4665. The resolution provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368, and H.R. 4665, under a structured rule for each bill. The resolution provides for one hour of general debate for each bill and one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 723 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The Speaker designated the Honorable Russ Fulcher to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 4367.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 20 minutes of debate on the Joyce (OH) amendment en bloc.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Nehls amendment No. 8.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the McCormick amendment No. 10.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Arrington amendment No. 11.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Mr. Joyce (OH) moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 4367 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Correa amendment No. 13.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Correa amendment No. 13, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Correa demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 19.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Wasserman Schultz amendment No. 23.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Wasserman Shultz amendment No. 23, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Wasserman Schultz demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Burchett amendment No. 24.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Burchett amendment No. 24, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Burchett demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Escobar amendment No. 25.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Escobar amendment No. 25, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Escobar demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Tony Gonzales (TX) amendment No. 26.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 29.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Clyde amendment No. 29, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Clyde demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 38.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 39.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 39, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Biggs demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 40.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 40, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Biggs demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 41.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 41, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Cuellar demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 42.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 42, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Biggs demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 43.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 43, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Biggs demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 44.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 45.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 46.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 47.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 48.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 48, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Cuellar demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 49.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 49, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Cuellar demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 50.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 50, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Cuellar demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Castro (TX) amendment No. 51.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Castro (TX) amendment No. 51, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Castro (TX) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 53.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 54.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 55.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 60.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 61.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 62.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Huizenga amendment No. 63.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Nehls amendment No. 64.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Nehls amendment No. 64, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Nehls demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 65.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"VACATING DEMAND FOR A RECORDED VOTE - Mr. Joyce (OH) asked unanimous consent that the request for a recorded vote on the Burchett amendment No. 24 be vacated to the end that the amendment be withdrawn. Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on agreeing to the amendments to H.R. 4367, which had been debated earlier and on which further proceedings had been postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 66.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norman amendment No. 66, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Cuellar demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 67.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norman amendment No. 67, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Cuellar demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 69.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norman amendment No. 69, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Cuellar demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 70.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 71.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Pfluger amendment No. 72.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 73.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 74.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Rosendale amendment No. 74, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Joyce (OH) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 75.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 76.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 77.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 78.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 79.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Rules Committee Resolution H. Res. 730 Reported to House. Rule provides for consideration of H.R. 5692, H.R. 4365 and H.R. 4367. The resolution provides for consideration of H.R. 5692, under a closed rule. The resolution provides for 30 minutes of general debate on the bill H.R. 5692 and one motion to recommit. The resolution provides that further consideration of H.R. 4365, the further amendments specified in section 3 shall be considered as adopted and the resolution provides for further consideration of H.R. 4367, the further amendment specified in section 5 shall be considered as adopted.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Malliotakis amendment No. 80.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Mr. Joyce (OH) moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 4367 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Rule H. Res. 730 passed House.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 4367.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of rule XIX, the Chair announced further proceedings on H.R. 4367 would be postponed","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Pursuant to clause 1(c) of rule XIX, the House resumed consideration of H.R. 4367.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Ms. Escobar moved to recommit to the Committee on Appropriations.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"On motion to recommit Failed by the Yeas and Nays: 210 - 218 (Roll no. 504).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"On passage Passed by the Yeas and Nays: 220 - 208 (Roll no. 505).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The Clerk was authorized to correct section numbers, punctuation, and cross references, and to make other necessary technical and conforming corrections in the engrossment of H.R. 4367.","chamber":"H","chamber_id":114,"importance":0}],"sponsors":[{"people_id":15224,"person_hash":"t5ugyagd","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"David Joyce","first_name":"David","middle_name":"","last_name":"Joyce","suffix":"","nickname":"","district":"HD-OH-14","ftm_eid":14885217,"votesmart_id":143052,"opensecrets_id":"N00035007","knowwho_pid":439365,"ballotpedia":"David_Joyce","bioguide_id":"J000295","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"SB2625","sast_bill_id":1775486},{"type_id":8,"type":"Related","sast_bill_number":"HR723","sast_bill_id":1778842},{"type_id":8,"type":"Related","sast_bill_number":"HR730","sast_bill_id":1778977},{"type_id":8,"type":"Related","sast_bill_number":"HB2882","sast_bill_id":1759619},{"type_id":8,"type":"Related","sast_bill_number":"HR1102","sast_bill_id":1867034}],"subjects":[{"subject_id":13437,"subject_name":"Emergency management"}],"texts":[{"doc_id":2831313,"date":"2023-06-28","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4367\/id\/2831313","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4367\/BILLS-118hr4367rh.pdf","text_size":363265,"text_hash":"a96fa1143d76bc52cae52939cc88370e","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":2866079,"date":"2023-10-05","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4367\/id\/2866079","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4367\/BILLS-118hr4367eh.pdf","text_size":254260,"text_hash":"35465c03a1eb085f7ec9a60a25c65155","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""}],"votes":[{"roll_call_id":1363274,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Biggs of Arizona Part B Amendment No. 42 RC# 44","yea":164,"nay":265,"nv":0,"absent":9,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363274","state_link":"https:\/\/clerk.house.gov\/Votes\/2023449"},{"roll_call_id":1363275,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Correa of California Part B Amendment No. 13 RC# 442","yea":206,"nay":223,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363275","state_link":"https:\/\/clerk.house.gov\/Votes\/2023442"},{"roll_call_id":1363276,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Wasserman Schultz of Florida Part B Amendment No. 23 RC# 443","yea":209,"nay":220,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363276","state_link":"https:\/\/clerk.house.gov\/Votes\/2023443"},{"roll_call_id":1363277,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Escobar of Texas Part B Amendment No. 25 RC# 444","yea":210,"nay":220,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363277","state_link":"https:\/\/clerk.house.gov\/Votes\/2023444"},{"roll_call_id":1363278,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Clyde of Georgia Part B Amendment No. 29 RC# 445","yea":108,"nay":320,"nv":0,"absent":10,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363278","state_link":"https:\/\/clerk.house.gov\/Votes\/2023445"},{"roll_call_id":1363279,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Biggs of Arizona Part B Amendment No. 39 RC# 446","yea":147,"nay":282,"nv":0,"absent":9,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363279","state_link":"https:\/\/clerk.house.gov\/Votes\/2023446"},{"roll_call_id":1363280,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Biggs of Arizona Part B Amendment No. 40 RC# 447","yea":160,"nay":270,"nv":0,"absent":8,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363280","state_link":"https:\/\/clerk.house.gov\/Votes\/2023447"},{"roll_call_id":1363281,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Biggs of Arizona Part B Amendment No. 41 RC# 448","yea":168,"nay":261,"nv":0,"absent":9,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363281","state_link":"https:\/\/clerk.house.gov\/Votes\/2023448"},{"roll_call_id":1363282,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Biggs of Arizona Part B Amendment No. 43 RC# 450","yea":162,"nay":264,"nv":0,"absent":12,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363282","state_link":"https:\/\/clerk.house.gov\/Votes\/2023450"},{"roll_call_id":1363283,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Boebert of Colorado Part B Amendment No. 48 RC# 451","yea":159,"nay":269,"nv":0,"absent":10,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363283","state_link":"https:\/\/clerk.house.gov\/Votes\/2023451"},{"roll_call_id":1363284,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Boebert of Colorado Part B Amendment No. 49 RC# 452","yea":161,"nay":267,"nv":0,"absent":10,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363284","state_link":"https:\/\/clerk.house.gov\/Votes\/2023452"},{"roll_call_id":1363285,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Boebert of Colorado Part B Amendment No. 50 RC# 453","yea":161,"nay":268,"nv":0,"absent":9,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363285","state_link":"https:\/\/clerk.house.gov\/Votes\/2023453"},{"roll_call_id":1363286,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Castro of Texas Part B Amendment No. 51 RC# 454","yea":211,"nay":220,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363286","state_link":"https:\/\/clerk.house.gov\/Votes\/2023454"},{"roll_call_id":1363287,"date":"2023-09-27","desc":"On Agreeing to the Amendment: Nehls of Texas Part B Amendment No. 64 RC# 455","yea":182,"nay":247,"nv":0,"absent":9,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363287","state_link":"https:\/\/clerk.house.gov\/Votes\/2023455"},{"roll_call_id":1363288,"date":"2023-09-28","desc":"On Motion to Recommit RC# 504","yea":210,"nay":218,"nv":0,"absent":5,"total":433,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363288","state_link":"https:\/\/clerk.house.gov\/Votes\/2023504"},{"roll_call_id":1363289,"date":"2023-09-28","desc":"On Passage RC# 505","yea":220,"nay":208,"nv":0,"absent":5,"total":433,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4367\/id\/1363289","state_link":"https:\/\/clerk.house.gov\/Votes\/2023505"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"event_hash":"48dcb6a7","type":"Hearing","date":"2023-09-22","time":"13:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"}]}}