{"bill":{"bill_id":1773284,"change_hash":"c5438762110e18fd30ebb7413ee2a52d","session_id":2041,"session":{"session_id":2041,"state_id":52,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"118th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB4365\/2023","state_link":"https:\/\/www.congress.gov\/bill\/118th-congress\/house-bill\/4365\/all-info","completed":0,"status":2,"status_date":"2023-10-16","progress":[{"date":"2023-06-27","event":1},{"date":"2023-10-16","event":2}],"state":"US","state_id":52,"bill_number":"HB4365","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"S","current_body_id":115,"title":"Department of Defense Appropriations Act, 2024","description":"Making appropriations for the Department of Defense for the fiscal year ending September 30, 2024, and for other purposes.","pending_committee_id":0,"committee":[],"referrals":[],"history":[{"date":"2023-06-27","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-27","action":"The House Committee on Appropriations reported an original measure, H. Rept. 118-121, by Mr. Calvert.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-27","action":"Placed on the Union Calendar, Calendar No. 93.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-13","action":"Rules Committee Resolution H. Res. 680 Reported to House. Rule provides for consideration of H.R. 1435 and H.R. 4365. The resolution provides for consideration of H.R. 1435 under a closed rule and H.R. 4365 under a structured rule. The rule provides for one hour of general debate on each measure with one motion to recommit allowed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-19","action":"Rule H. Res. 680 failed passage of House.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-21","action":"Rules Committee Resolution H. Res. 712 Reported to House. Rule provides for consideration of H.R. 4365, H.R. 1130 and H. Res. 684. The resolution provides for consideration of H.R. 4365, under a structured rule; H.R. 1130, under a structured rule; and H.Res. 684, under a closed rule. The resolution provides for one hour of general debate on all three bills.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"Rules Committee Resolution H. Res. 723 Reported to House. Rule provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368 and H.R. 4665. The resolution provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368, and H.R. 4665, under a structured rule for each bill. The resolution provides for one hour of general debate for each bill and one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Considered under the provisions of rule H. Res. 723.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Rule provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368 and H.R. 4665. The resolution provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368, and H.R. 4665, under a structured rule for each bill. The resolution provides for one hour of general debate for each bill and one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 723 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The Speaker designated the Honorable Mike Carey to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 4365.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 20 minutes of debate on the Calvert amendment en bloc No. 1.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 20 minutes of debate on the Calvert amendment en bloc No. 2.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Houlahan amendment No. 34.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Houlahan amendment No. 34, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Houlahan demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Luttrell amendment No. 48.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norton amendment No. 125.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norton amendment No. 125, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Norton demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 149.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 149, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Griffith amendment No. 150.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Plaskett amendment No. 151.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Plaskett amendment No. 151, the Chair put the question on agreeing to the amendment and by voice vote announced that the noes had prevailed. Ms. Plaskett demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 152.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 152, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 153.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 153, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 154.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Clyde amendment No. 154, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Molinaro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 155.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Clyde amendment No. 155, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Connolly amendment No. 156.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Connolly amendment No. 156, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Connolly demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Crane amendment No. 157.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"VACATING DEMAND FOR A RECORDED VOTE - Ms. McCollum asked unanimous consent that the request for a recorded vote on the Norton amendment No. 125 be withdrawn to the end that the amendment stands disposed by the earlier voice vote that was recorded thereon. Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Fallon amendment No. 158.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Gaetz amendment No. 160.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gaetz amendment No. 160, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Gaetz demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Gaetz amendment No. 161.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gaetz amendment No. 161, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Calvert demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 164.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 165.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Jayapal amendment No. 166.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Jayapal amendment No. 166, the Chair put the question on agreeing to the amendment and by voice vote announced that the noes had prevailed. Ms. Jayapal demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"VACATING DEMAND FOR A RECORDED VOTE - Mr. Molinaro asked unanimous consent that the request for a recorded vote on the Clyde amendment No. 154 be withdrawn to the end that the amendment stands disposed by the earlier voice vote that was recorded thereon. Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the D'Esposito amendment No. 167.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 168.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 169.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 170.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 171.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 172.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 173.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 174.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 175.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Roy amendment No. 175, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. McCollum demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 176.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 177.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 178.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 179.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 180.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Mr. Calvert moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 4365 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on agreeing to the amendments to H.R. 4365, which had been debated earlier and on which further proceedings had been postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 4365.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of rule XIX further proceedings were postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Rules Committee Resolution H. Res. 730 Reported to House. Rule provides for consideration of H.R. 5692, H.R. 4365 and H.R. 4367. The resolution provides for consideration of H.R. 5692, under a closed rule. The resolution provides for 30 minutes of general debate on the bill H.R. 5692 and one motion to recommit. The resolution provides that further consideration of H.R. 4365, the further amendments specified in section 3 shall be considered as adopted and the resolution provides for further consideration of H.R. 4367, the further amendment specified in section 5 shall be considered as adopted.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Pursuant to clause 1(c) of rule XIX, the House resumed consideration of H.R 4365.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Ms. Jacobs moved to recommit to the Committee on Appropriations.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"On motion to recommit Failed by the Yeas and Nays: 210 - 218 (Roll no. 501).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"On passage Passed by the Yeas and Nays: 218 - 210 (Roll no. 502).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The Clerk was authorized to correct section numbers, punctuation, and cross references, and to make other necessary technical and conforming corrections in the engrossment of H.R. 4365.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-16","action":"Received in the Senate. Read twice. Placed on Senate Legislative Calendar under General Orders. Calendar No. 226.","chamber":"S","chamber_id":115,"importance":1}],"sponsors":[{"people_id":9211,"person_hash":"lvvhvgma","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Ken Calvert","first_name":"Ken","middle_name":"","last_name":"Calvert","suffix":"","nickname":"","district":"HD-CA-41","ftm_eid":2378663,"votesmart_id":26777,"opensecrets_id":"N00007099","knowwho_pid":158760,"ballotpedia":"Ken_Calvert","bioguide_id":"C000059","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HB143","sast_bill_id":1651049},{"type_id":8,"type":"Related","sast_bill_number":"SB2587","sast_bill_id":1775655},{"type_id":8,"type":"Related","sast_bill_number":"HR680","sast_bill_id":1777819},{"type_id":8,"type":"Related","sast_bill_number":"HR712","sast_bill_id":1778513},{"type_id":8,"type":"Related","sast_bill_number":"HR723","sast_bill_id":1778842},{"type_id":8,"type":"Related","sast_bill_number":"HR730","sast_bill_id":1778977},{"type_id":8,"type":"Related","sast_bill_number":"SB2927","sast_bill_id":1778760},{"type_id":8,"type":"Related","sast_bill_number":"HB2882","sast_bill_id":1759619},{"type_id":8,"type":"Related","sast_bill_number":"HR1102","sast_bill_id":1867034}],"subjects":[{"subject_id":13358,"subject_name":"Armed forces and national security"}],"texts":[{"doc_id":2831316,"date":"2023-06-28","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4365\/id\/2831316","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4365\/BILLS-118hr4365rh.pdf","text_size":444208,"text_hash":"091a32267d07922fbd36a109cee3417d","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":2845151,"date":"2023-10-12","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4365\/id\/2845151","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4365\/BILLS-118hr4365eh.pdf","text_size":327337,"text_hash":"53d0a03b4f553cfc445a6135836e4a26","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":2846650,"date":"2023-10-18","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4365\/id\/2846650","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4365\/BILLS-118hr4365pcs.pdf","text_size":432399,"text_hash":"439b1129b12da7fffccad18c630700f1","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""}],"votes":[{"roll_call_id":1355357,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 431","yea":240,"nay":191,"nv":0,"absent":8,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355357","state_link":"https:\/\/clerk.house.gov\/Votes\/2023431"},{"roll_call_id":1355358,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 432","yea":104,"nay":330,"nv":0,"absent":5,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355358","state_link":"https:\/\/clerk.house.gov\/Votes\/2023432"},{"roll_call_id":1355359,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 433","yea":203,"nay":231,"nv":0,"absent":5,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355359","state_link":"https:\/\/clerk.house.gov\/Votes\/2023433"},{"roll_call_id":1355360,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 434","yea":150,"nay":282,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355360","state_link":"https:\/\/clerk.house.gov\/Votes\/2023434"},{"roll_call_id":1355361,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 435","yea":184,"nay":248,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355361","state_link":"https:\/\/clerk.house.gov\/Votes\/2023435"},{"roll_call_id":1355362,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 436","yea":172,"nay":261,"nv":0,"absent":6,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355362","state_link":"https:\/\/clerk.house.gov\/Votes\/2023436"},{"roll_call_id":1355363,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 437","yea":215,"nay":218,"nv":0,"absent":6,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355363","state_link":"https:\/\/clerk.house.gov\/Votes\/2023437"},{"roll_call_id":1355364,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 438","yea":93,"nay":339,"nv":0,"absent":7,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355364","state_link":"https:\/\/clerk.house.gov\/Votes\/2023438"},{"roll_call_id":1355365,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 439","yea":160,"nay":269,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355365","state_link":"https:\/\/clerk.house.gov\/Votes\/2023439"},{"roll_call_id":1355366,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 440","yea":176,"nay":258,"nv":0,"absent":5,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355366","state_link":"https:\/\/clerk.house.gov\/Votes\/2023440"},{"roll_call_id":1355367,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 441","yea":202,"nay":231,"nv":0,"absent":6,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355367","state_link":"https:\/\/clerk.house.gov\/Votes\/2023441"},{"roll_call_id":1355368,"date":"2023-09-28","desc":"On Motion to Recommit RC# 501","yea":210,"nay":218,"nv":0,"absent":5,"total":433,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355368","state_link":"https:\/\/clerk.house.gov\/Votes\/2023501"},{"roll_call_id":1355369,"date":"2023-09-28","desc":"On Passage RC# 502","yea":218,"nay":210,"nv":0,"absent":5,"total":433,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4365\/id\/1355369","state_link":"https:\/\/clerk.house.gov\/Votes\/2023502"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"event_hash":"a6cd1ce0","type":"Hearing","date":"2023-09-12","time":"16:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"},{"type_id":1,"event_hash":"aaae3d61","type":"Hearing","date":"2023-09-20","time":"19:45","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"},{"type_id":1,"event_hash":"48dcb6a7","type":"Hearing","date":"2023-09-22","time":"13:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"}]}}