{"bill":{"bill_id":1773268,"change_hash":"0490101d77ea3d2ead31db088f470c83","session_id":2041,"session":{"session_id":2041,"state_id":52,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"118th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB4368\/2023","state_link":"https:\/\/www.congress.gov\/bill\/118th-congress\/house-bill\/4368\/all-info","completed":0,"status":1,"status_date":"2023-06-27","progress":[{"date":"2023-06-27","event":1}],"state":"US","state_id":52,"bill_number":"HB4368","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"H","current_body_id":114,"title":"Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act, 2024","description":"Making appropriations for Agriculture, Rural Development, Food and Drug Administration, and Related Agencies programs for the fiscal year ending September 30, 2024, and for other purposes.","pending_committee_id":0,"committee":[],"referrals":[],"history":[{"date":"2023-06-27","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-27","action":"The House Committee on Appropriations reported an original measure, H. Rept. 118-124, by Mr. Harris.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-27","action":"Placed on the Union Calendar, Calendar No. 96.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"Rules Committee Resolution H. Res. 723 Reported to House. Rule provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368 and H.R. 4665. The resolution provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368, and H.R. 4665, under a structured rule for each bill. The resolution provides for one hour of general debate for each bill and one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"Considered under the provisions of rule H. Res. 723.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"Rule provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368 and H.R. 4665. The resolution provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368, and H.R. 4665, under a structured rule for each bill. The resolution provides for one hour of general debate for each bill and one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 723 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"The Speaker designated the Honorable Cliff Bentz to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 4368.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 20 minutes of debate on the Harris amendment en bloc.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 15.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 24.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Good (VA) amendment No. 24, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 29.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 29, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 33.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 33, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 38.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 41.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Brecheen amendment No. 41, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 43.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Brecheen amendment No. 43, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 45.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 45, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Nunn amendment No. 48.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Donalds amendment No. 51.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 54.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 54, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 56.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 57.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 57, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 61.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Biggs amendment No. 61, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Thompson (PA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Donalds amendment No. 62.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Graves (LA) amendment No. 65.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 66.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Bost amendment No. 67.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the McCormick amendment No. 68.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 69.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-26","action":"UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on agreeing to the amendments to H.R. 4368, which had been debated earlier and on which further proceedings had been postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 71.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Crawford amendment No. 72.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 73.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Van Orden amendment No. 74.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 75.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Spartz amendment No. 76.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Spartz amendment No. 76, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Thompson (PA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 77.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 78.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 79.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 79, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Self amendment No. 80.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Burlison amendment No. 81.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 82.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 83.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Hageman amendment No. 83, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Thompson (PA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 85.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Good (VA) amendment No. 85, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Massie amendment No. 86.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Massie amendment No. 87.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 89.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Boebert amendment No. 89, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 90.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEINGS - At the conclusion of debate on the Good (VA) amendment No. 90, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 91.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Good (VA) amendment No. 91, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 92.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Good (VA) amendment No. 92, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 93.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Good (VA) amendment No. 93, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 94.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Good (VA) amendment No. 94, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 95.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Good (VA) amendment No. 95, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Stauber amendment No. 99.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Stauber amendment No. 99, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 100.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 101.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Miller (IL) amendment No. 101, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"DEBATE - Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 102.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Rosendale amendment No. 102, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Bishop (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Mr. Harris moved that the commiteee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"On motion that the commiteee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 4368 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on agreeing to the amendments to H.R. 4368, which had been debated earlier and on which further proceedings had been postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 4368.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-27","action":"POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of rule XIX further proceedings were postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Pursuant to clause 1(c) of rule XIX, the House resumed consideration of H.R 4368.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Ms. Budzinski moved to recommit to the Committee on Appropriations.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"On motion to recommit Failed by the Yeas and Nays: 211 - 217 (Roll no. 506).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Failed of passage\/not agreed to in House On passage Failed by the Yeas and Nays: 191 - 237 (Roll no. 507).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"On passage Failed by the Yeas and Nays: 191 - 237 (Roll no. 507).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-09-28","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0}],"sponsors":[{"people_id":11605,"person_hash":"gz4ylu49","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Andy Harris","first_name":"Andy","middle_name":"","last_name":"Harris","suffix":"","nickname":"","district":"HD-MD-1","ftm_eid":4600723,"votesmart_id":19157,"opensecrets_id":"N00029147","knowwho_pid":195206,"ballotpedia":"Andy_Harris","bioguide_id":"H001052","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":4683}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HB383","sast_bill_id":1664820},{"type_id":8,"type":"Related","sast_bill_number":"SB2131","sast_bill_id":1772766},{"type_id":8,"type":"Related","sast_bill_number":"HR723","sast_bill_id":1778842},{"type_id":8,"type":"Related","sast_bill_number":"HB4366","sast_bill_id":1773292},{"type_id":8,"type":"Related","sast_bill_number":"HR1061","sast_bill_id":1860939}],"subjects":[{"subject_id":13597,"subject_name":"Agriculture and food"}],"texts":[{"doc_id":2831311,"date":"2023-06-28","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4368\/id\/2831311","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4368\/BILLS-118hr4368rh.pdf","text_size":405869,"text_hash":"c1362e9bb12b078642fb2da4398f8dd5","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""}],"votes":[{"roll_call_id":1355370,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 408","yea":175,"nay":254,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355370","state_link":"https:\/\/clerk.house.gov\/Votes\/2023408"},{"roll_call_id":1355371,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 409","yea":119,"nay":307,"nv":0,"absent":13,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355371","state_link":"https:\/\/clerk.house.gov\/Votes\/2023409"},{"roll_call_id":1355372,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 410","yea":106,"nay":323,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355372","state_link":"https:\/\/clerk.house.gov\/Votes\/2023410"},{"roll_call_id":1355373,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 411","yea":86,"nay":343,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355373","state_link":"https:\/\/clerk.house.gov\/Votes\/2023411"},{"roll_call_id":1355374,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 412","yea":89,"nay":341,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355374","state_link":"https:\/\/clerk.house.gov\/Votes\/2023412"},{"roll_call_id":1355375,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 413","yea":68,"nay":362,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355375","state_link":"https:\/\/clerk.house.gov\/Votes\/2023413"},{"roll_call_id":1355376,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 414","yea":83,"nay":348,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355376","state_link":"https:\/\/clerk.house.gov\/Votes\/2023414"},{"roll_call_id":1355377,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 415","yea":81,"nay":350,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355377","state_link":"https:\/\/clerk.house.gov\/Votes\/2023415"},{"roll_call_id":1355378,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 416","yea":105,"nay":325,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355378","state_link":"https:\/\/clerk.house.gov\/Votes\/2023416"},{"roll_call_id":1355379,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 417","yea":49,"nay":377,"nv":0,"absent":13,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355379","state_link":"https:\/\/clerk.house.gov\/Votes\/2023417"},{"roll_call_id":1355380,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 418","yea":210,"nay":216,"nv":0,"absent":13,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355380","state_link":"https:\/\/clerk.house.gov\/Votes\/2023418"},{"roll_call_id":1355381,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 419","yea":97,"nay":336,"nv":0,"absent":6,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355381","state_link":"https:\/\/clerk.house.gov\/Votes\/2023419"},{"roll_call_id":1355382,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 420","yea":152,"nay":278,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355382","state_link":"https:\/\/clerk.house.gov\/Votes\/2023420"},{"roll_call_id":1355383,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 421","yea":217,"nay":214,"nv":0,"absent":8,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355383","state_link":"https:\/\/clerk.house.gov\/Votes\/2023421"},{"roll_call_id":1355384,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 422","yea":158,"nay":272,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355384","state_link":"https:\/\/clerk.house.gov\/Votes\/2023422"},{"roll_call_id":1355385,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 423","yea":159,"nay":272,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355385","state_link":"https:\/\/clerk.house.gov\/Votes\/2023423"},{"roll_call_id":1355386,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 424","yea":156,"nay":273,"nv":0,"absent":10,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355386","state_link":"https:\/\/clerk.house.gov\/Votes\/2023424"},{"roll_call_id":1355387,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 425","yea":161,"nay":270,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355387","state_link":"https:\/\/clerk.house.gov\/Votes\/2023425"},{"roll_call_id":1355388,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 426","yea":160,"nay":271,"nv":0,"absent":8,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355388","state_link":"https:\/\/clerk.house.gov\/Votes\/2023426"},{"roll_call_id":1355389,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 427","yea":163,"nay":267,"nv":0,"absent":9,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355389","state_link":"https:\/\/clerk.house.gov\/Votes\/2023427"},{"roll_call_id":1355390,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 428","yea":217,"nay":216,"nv":0,"absent":6,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355390","state_link":"https:\/\/clerk.house.gov\/Votes\/2023428"},{"roll_call_id":1355391,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 429","yea":217,"nay":216,"nv":0,"absent":6,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355391","state_link":"https:\/\/clerk.house.gov\/Votes\/2023429"},{"roll_call_id":1355392,"date":"2023-09-27","desc":"On Agreeing to the Amendment RC# 430","yea":71,"nay":362,"nv":0,"absent":6,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355392","state_link":"https:\/\/clerk.house.gov\/Votes\/2023430"},{"roll_call_id":1355393,"date":"2023-09-28","desc":"On Motion to Recommit RC# 506","yea":211,"nay":217,"nv":0,"absent":5,"total":433,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355393","state_link":"https:\/\/clerk.house.gov\/Votes\/2023506"},{"roll_call_id":1355394,"date":"2023-09-28","desc":"On Passage RC# 507","yea":191,"nay":237,"nv":0,"absent":5,"total":433,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4368\/id\/1355394","state_link":"https:\/\/clerk.house.gov\/Votes\/2023507"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"event_hash":"90f60778","type":"Hearing","date":"2023-07-26","time":"14:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"},{"type_id":1,"event_hash":"48dcb6a7","type":"Hearing","date":"2023-09-22","time":"13:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"}]}}