{"bill":{"bill_id":1773669,"change_hash":"aba722484d1d42b9913c4f2299034869","session_id":2041,"session":{"session_id":2041,"state_id":52,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"118th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB4394\/2023","state_link":"https:\/\/www.congress.gov\/bill\/118th-congress\/house-bill\/4394\/all-info","completed":0,"status":2,"status_date":"2023-11-01","progress":[{"date":"2023-06-30","event":1},{"date":"2023-11-01","event":2}],"state":"US","state_id":52,"bill_number":"HB4394","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"S","current_body_id":115,"title":"Energy and Water Development and Related Agencies Appropriations Act, 2024","description":"Making appropriations for energy and water development and related agencies for the fiscal year ending September 30, 2024, and for other purposes.","pending_committee_id":0,"committee":[],"referrals":[],"history":[{"date":"2023-06-30","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-30","action":"The House Committee on Appropriations reported an original measure, H. Rept. 118-126, by Mr. Fleischmann.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-06-30","action":"Placed on the Union Calendar, Calendar No. 98.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-03","action":"Rules Committee Resolution H. Res. 756 Reported to House. Rule provides for consideration of H.R. 4394 and H.R. 4364. The resolution provides for consideration of H.R. 4394 and H.R. 4364. Resolution provides for consideration of H.R. 4394, under a structured rule with one hour of general debate and one motion to recommit. The resolution provides for consideration of H.R. 4364 under a closed rule with one hour of general debate and one motion to recommit. The resolution lays H. Res. 699 on the table.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"Considered under the provisions of rule H. Res. 756.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"Rule provides for consideration of H.R. 4394 and H.R. 4364. The resolution provides for consideration of H.R. 4394 and H.R. 4364. Resolution provides for consideration of H.R. 4394, under a structured rule with one hour of general debate and one motion to recommit. The resolution provides for consideration of H.R. 4364 under a closed rule with one hour of general debate and one motion to recommit. The resolution lays H. Res. 699 on the table.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"The Speaker designated the Honorable Mike Flood to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 756 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 4394.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 20 minutes of debate on the Fleischmann amendment en bloc.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 3.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 3, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mrs. Watson Coleman demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Neguse amendment No. 12.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Neguse amendment No. 12, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Neguse demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Neguse amendment No. 13.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Westerman amendment No. 14.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Westerman amendment No. 14, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Kaptur demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Griffith amendment No. 15.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Griffith amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Griffith demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 16.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Roy amendment No. 16, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Roy demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 19.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 19, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 20.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norman amendment No. 20, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Norman demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 25.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 25, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 26.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 26, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 27.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 27, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 28.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 28, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 29.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 29, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 30.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 30, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 31.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 31, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 32.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 32, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 34.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Fallon amendment No. 35.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"Mr. Fleischmann moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-25","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 4394 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Garamendi amendment No. 36.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Garamendi amendment No. 36, the Chair put the question on agreeing to the amendment and by voice vote announced that the noes had prevailed. Mr. Garamendi demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Garamendi amendment No. 37.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Garamendi amendment No. 37, the Chair put the question on agreeing to the amendment and by voice vote announced that the noes had prevailed. Mr. Garamendi demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 38.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 39.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Hageman amendment No. 39, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Fleischmann demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 40.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"UNFINISHED BUSINESS - The Chair announced that the unfinished business was the question on agreeing to the amendments to H.R. 4394, which had been debated earlier and on which further proceedings had been postponed.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson (TX) amendment No. 41.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Lamborn amendment No. 42.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Luna amendment No. 43.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Luna amendment No. 43, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. Kaptur demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Luna amendment No. 44.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the McCormick amendment No. 45.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 46.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 47.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norman amendment No. 47, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Kaptur demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 48.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 49.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 50.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norman amendment No. 50, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Kaptur demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 51.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Norman amendment No. 51, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. James demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 52.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 53.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Palmer amendment No. 54.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Pfluger amendment No. 56.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Pfluger amendment No. 56, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Kaptur demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Pfluger amendment No. 57.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Pfluger amendment No. 57, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Kaptur demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 58.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Rosendale amendment No. 58, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Fleischmann demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 59.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Rosendale amendment No. 59, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Rosendale demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"DEBATE - Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 60.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Rosendale amendment No. 60, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Rosendale demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"Pursuant to clause 6(h) of rule XVIII, the Committee rose.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"Pursuant to clause 6(h) of rule XVIII, the Committee of the Whole resumed its sitting.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 4394.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"Ms. Castor (FL) moved to recommit to the Committee on Appropriations.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"On motion to recommit Failed by the Yeas and Nays: 199 - 210 (Roll no. 557).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"On passage Passed by the Yeas and Nays: 210 - 199 (Roll no. 558).","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"Motion to reconsider laid on the table Agreed to without objection.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-10-26","action":"The Clerk was authorized to correct section numbers, punctuation, and cross references, and to make other necessary technical and conforming corrections in the engrossment of H.R. 4394.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-01","action":"Received in the Senate. Read twice. Placed on Senate Legislative Calendar under General Orders. Calendar No. 233.","chamber":"S","chamber_id":115,"importance":1}],"sponsors":[{"people_id":11129,"person_hash":"4rsz141z","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Charles Fleischmann","first_name":"Charles","middle_name":"J.","last_name":"Fleischmann","suffix":"","nickname":"Chuck","district":"HD-TN-3","ftm_eid":9391800,"votesmart_id":123456,"opensecrets_id":"N00030815","knowwho_pid":285119,"ballotpedia":"Charles_Fleischmann","bioguide_id":"F000459","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HB186","sast_bill_id":1651029},{"type_id":8,"type":"Related","sast_bill_number":"HB215","sast_bill_id":1650593},{"type_id":8,"type":"Related","sast_bill_number":"SB2443","sast_bill_id":1774970},{"type_id":8,"type":"Related","sast_bill_number":"HR756","sast_bill_id":1779625},{"type_id":8,"type":"Related","sast_bill_number":"HB4366","sast_bill_id":1773292}],"subjects":[{"subject_id":13124,"subject_name":"Economics and public finance"}],"texts":[{"doc_id":2832355,"date":"2023-07-01","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4394\/id\/2832355","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4394\/BILLS-118hr4394rh.pdf","text_size":376367,"text_hash":"8a46b1597340890304f7259522cb9b6b","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":2848234,"date":"2023-11-02","type":"Engrossed","type_id":4,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4394\/id\/2848234","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4394\/BILLS-118hr4394eh.pdf","text_size":266272,"text_hash":"0f6cdcb6eaaacbdc87a1a354e1b3eea6","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""},{"doc_id":2848514,"date":"2023-11-02","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4394\/id\/2848514","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4394\/BILLS-118hr4394pcs.pdf","text_size":362041,"text_hash":"f73e0a99bd9ddf3d491a37c16d166264","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""}],"votes":[{"roll_call_id":1356621,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 529","yea":156,"nay":265,"nv":0,"absent":17,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356621","state_link":"https:\/\/clerk.house.gov\/Votes\/2023529"},{"roll_call_id":1356622,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 530","yea":277,"nay":142,"nv":0,"absent":19,"total":438,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356622","state_link":"https:\/\/clerk.house.gov\/Votes\/2023530"},{"roll_call_id":1356623,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 531","yea":212,"nay":213,"nv":0,"absent":13,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356623","state_link":"https:\/\/clerk.house.gov\/Votes\/2023531"},{"roll_call_id":1356624,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 532","yea":161,"nay":257,"nv":0,"absent":20,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356624","state_link":"https:\/\/clerk.house.gov\/Votes\/2023532"},{"roll_call_id":1356625,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 533","yea":137,"nay":287,"nv":0,"absent":14,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356625","state_link":"https:\/\/clerk.house.gov\/Votes\/2023533"},{"roll_call_id":1356626,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 534","yea":135,"nay":284,"nv":0,"absent":19,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356626","state_link":"https:\/\/clerk.house.gov\/Votes\/2023534"},{"roll_call_id":1356627,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 535","yea":105,"nay":319,"nv":0,"absent":14,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356627","state_link":"https:\/\/clerk.house.gov\/Votes\/2023535"},{"roll_call_id":1356628,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 536","yea":115,"nay":306,"nv":0,"absent":17,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356628","state_link":"https:\/\/clerk.house.gov\/Votes\/2023536"},{"roll_call_id":1356629,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 537","yea":123,"nay":300,"nv":0,"absent":15,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356629","state_link":"https:\/\/clerk.house.gov\/Votes\/2023537"},{"roll_call_id":1356630,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 538","yea":137,"nay":283,"nv":0,"absent":18,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356630","state_link":"https:\/\/clerk.house.gov\/Votes\/2023538"},{"roll_call_id":1356631,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 539","yea":105,"nay":316,"nv":0,"absent":17,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356631","state_link":"https:\/\/clerk.house.gov\/Votes\/2023539"},{"roll_call_id":1356632,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 540","yea":134,"nay":283,"nv":0,"absent":21,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356632","state_link":"https:\/\/clerk.house.gov\/Votes\/2023540"},{"roll_call_id":1356633,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 541","yea":122,"nay":299,"nv":0,"absent":17,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356633","state_link":"https:\/\/clerk.house.gov\/Votes\/2023541"},{"roll_call_id":1356634,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 542","yea":130,"nay":287,"nv":0,"absent":21,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356634","state_link":"https:\/\/clerk.house.gov\/Votes\/2023542"},{"roll_call_id":1356635,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 543","yea":122,"nay":295,"nv":0,"absent":21,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356635","state_link":"https:\/\/clerk.house.gov\/Votes\/2023543"},{"roll_call_id":1356636,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 544","yea":116,"nay":303,"nv":0,"absent":19,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356636","state_link":"https:\/\/clerk.house.gov\/Votes\/2023544"},{"roll_call_id":1356637,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 545","yea":121,"nay":299,"nv":0,"absent":18,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356637","state_link":"https:\/\/clerk.house.gov\/Votes\/2023545"},{"roll_call_id":1356638,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 546","yea":176,"nay":241,"nv":0,"absent":21,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356638","state_link":"https:\/\/clerk.house.gov\/Votes\/2023546"},{"roll_call_id":1356639,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 547","yea":120,"nay":291,"nv":0,"absent":27,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356639","state_link":"https:\/\/clerk.house.gov\/Votes\/2023547"},{"roll_call_id":1356640,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 548","yea":207,"nay":204,"nv":0,"absent":28,"total":439,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356640","state_link":"https:\/\/clerk.house.gov\/Votes\/2023548"},{"roll_call_id":1356641,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 549","yea":208,"nay":209,"nv":0,"absent":22,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356641","state_link":"https:\/\/clerk.house.gov\/Votes\/2023549"},{"roll_call_id":1356642,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 550","yea":207,"nay":204,"nv":0,"absent":22,"total":433,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356642","state_link":"https:\/\/clerk.house.gov\/Votes\/2023550"},{"roll_call_id":1356643,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 551","yea":166,"nay":247,"nv":0,"absent":26,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356643","state_link":"https:\/\/clerk.house.gov\/Votes\/2023551"},{"roll_call_id":1356644,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 552","yea":160,"nay":250,"nv":0,"absent":29,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356644","state_link":"https:\/\/clerk.house.gov\/Votes\/2023552"},{"roll_call_id":1356645,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 553","yea":164,"nay":249,"nv":0,"absent":26,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356645","state_link":"https:\/\/clerk.house.gov\/Votes\/2023553"},{"roll_call_id":1356646,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 554","yea":100,"nay":314,"nv":0,"absent":25,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356646","state_link":"https:\/\/clerk.house.gov\/Votes\/2023554"},{"roll_call_id":1356647,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 555","yea":76,"nay":335,"nv":0,"absent":27,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356647","state_link":"https:\/\/clerk.house.gov\/Votes\/2023555"},{"roll_call_id":1356648,"date":"2023-10-26","desc":"On Agreeing to the Amendment RC# 556","yea":192,"nay":222,"nv":0,"absent":25,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356648","state_link":"https:\/\/clerk.house.gov\/Votes\/2023556"},{"roll_call_id":1356649,"date":"2023-10-26","desc":"On Motion to Recommit RC# 557","yea":199,"nay":210,"nv":0,"absent":23,"total":432,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356649","state_link":"https:\/\/clerk.house.gov\/Votes\/2023557"},{"roll_call_id":1356650,"date":"2023-10-26","desc":"On Passage RC# 558","yea":210,"nay":199,"nv":0,"absent":24,"total":433,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4394\/id\/1356650","state_link":"https:\/\/clerk.house.gov\/Votes\/2023558"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"event_hash":"222626d5","type":"Hearing","date":"2023-10-02","time":"16:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"}]}}