{"bill":{"bill_id":1774612,"change_hash":"ab70f148f8eabc20e25661a2d8e91413","session_id":2041,"session":{"session_id":2041,"state_id":52,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"118th Congress"},"url":"https:\/\/legiscan.com\/US\/bill\/HB4664\/2023","state_link":"https:\/\/www.congress.gov\/bill\/118th-congress\/house-bill\/4664\/all-info","completed":0,"status":1,"status_date":"2023-07-17","progress":[{"date":"2023-07-17","event":1}],"state":"US","state_id":52,"bill_number":"HB4664","bill_type":"B","bill_type_id":"1","body":"H","body_id":114,"current_body":"H","current_body_id":114,"title":"District of Columbia Appropriations Act, 2024 Executive Office of the President Appropriations Act, 2024 Department of the Treasury Appropriations Act, 2024 Financial Services and General Government Appropriations Act, 2024 Judiciary Appropriations Act, 2024","description":"Making appropriations for financial services and general government for the fiscal year ending September 30, 2024, and for other purposes.","pending_committee_id":0,"committee":[],"referrals":[],"history":[{"date":"2023-07-17","action":"Introduced in House","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-07-17","action":"The House Committee on Appropriations reported an original measure, H. Rept. 118-145, by Mr. Womack.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-07-17","action":"Placed on the Union Calendar, Calendar No. 114.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-06","action":"Rules Committee Resolution H. Res. 847 Reported to House. Rule provides for consideration of H.R. 4664. The resolution provides for consideration of H.R. 4664 under a structured rule with one hour of general debate, with one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-07","action":"Rule H. Res. 847 passed House.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"Considered under the provisions of rule H. Res. 847.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"Rule provides for consideration of H.R. 4664. The resolution provides for consideration of H.R. 4664 under a structured rule with one hour of general debate, with one motion to recommit.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 847 and Rule XVIII.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"The Speaker designated the Honorable Brandon Williams to act as Chairman of the Committee.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"GENERAL DEBATE - The Committee of the Whole proceeded with one hour of general debate on H.R. 4664.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 20 minutes of debate on the Womack amendment en bloc.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Molinaro amendment No. 2.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Molinaro amendment No. 2, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Molinaro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 9.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Grothman amendment No. 9, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Grothman demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 11.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Bice amendment No. 12.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Harshbarger amendment No. 15.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Harshbarger amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Ms. Harshbarger demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Davidson amendment No. 16.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 18.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 18, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ramirez amendment No. 19.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 21.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ogles amendment No. 21, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 24.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Perry amendment No. 24, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 26.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Burlison amendment No. 27.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 30.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Barr amendment No. 37.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Barr amendment No. 37, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Barr demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Barr amendment No. 38.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Barr amendment No. 38, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Bean (FL) amendment No. 39.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Bean (FL) amendment No. 39, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 40.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 41.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Burchett amendment No. 42.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Burchett amendment No. 42, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 43.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Collins amendment No. 44.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Collins amendment No. 44, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Davidson amendment No. 45.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Emmer amendment No. 46.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fischbach amendment No. 47.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzgerald amendment No. 48.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzgerald amendment No. 49.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzgerald amendment No. 50.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzgerald amendment No. 51.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H.Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Foxx amendment No. 52.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H.Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fry amendment No. 53.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H.Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Gaetz amendment No. 54.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Gaetz amendment No. 54, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Womack demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H.Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 55.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 56.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Graves (LA) amendment No. 57.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Harshbarger amendment No. 63.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Harshbarger amendment No. 63, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Pocan demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Hill amendment No. 64.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Huizenga amendment No. 65.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Luetkemeyer amendment No. 68.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Meuser amendment No. 70.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Mooney amendment No. 72.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Mooney amendment No. 73.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Moore (UT) amendment No. 74.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 76.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 77.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 78.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 79.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Nunn (IA) amendment No. 80.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Nunn (IA) amendment No. 81.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 82.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 83.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 84.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ogles amendment No. 84, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Cartwright demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 86.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 87.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Ogles amendment No. 87, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Cartwright demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 89.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 90.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 91.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Rosendale amendment No. 91, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Cartwright demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 92.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Rosendale amendment No. 92, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Cartwright demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 93.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 94.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Salazar amendment No. 95.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Salazar amendment No. 95, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Salazar demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Sessions amendment No. 96.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 97.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 98.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Steube amendment No. 99.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"Mr. Womack moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 4664 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"Mr. Womack moved that the committee rise.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"On motion that the committee rise Agreed to by voice vote.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-08","action":"Committee of the Whole House on the state of the Union rises leaving H.R. 4664 as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"Considered as unfinished business.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 100.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Tenney amendment No. 100, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 101.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"POSTPONED PROCEEDINGS - At the conclusion of debate on the Tenney amendment No. 101, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Tenney demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Wagner amendment No. 102.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"DEBATE - Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Williams (TX) amendment No. 104.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 4664.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"The previous question was ordered pursuant to the rule.","chamber":"H","chamber_id":114,"importance":0},{"date":"2023-11-09","action":"POSTPONED PROCEEDINGS - Pursuant to clause 1(c) of rule XIX, the Chair announced further proceedings on H.R. 4664 would be postponed.","chamber":"H","chamber_id":114,"importance":0}],"sponsors":[{"people_id":11099,"person_hash":"wdolqnr4","party_id":"2","state_id":52,"party":"R","role_id":1,"role":"Rep","name":"Steve Womack","first_name":"Steve","middle_name":"","last_name":"Womack","suffix":"","nickname":"","district":"HD-AR-3","ftm_eid":9604218,"votesmart_id":71815,"opensecrets_id":"N00031857","knowwho_pid":285713,"ballotpedia":"Steve_Womack","bioguide_id":"W000809","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":8,"type":"Related","sast_bill_number":"HB1410","sast_bill_id":1729829},{"type_id":8,"type":"Related","sast_bill_number":"SB2309","sast_bill_id":1774427},{"type_id":8,"type":"Related","sast_bill_number":"HR847","sast_bill_id":1782892},{"type_id":8,"type":"Related","sast_bill_number":"HB2882","sast_bill_id":1759619},{"type_id":8,"type":"Related","sast_bill_number":"HR1102","sast_bill_id":1867034}],"subjects":[{"subject_id":13124,"subject_name":"Economics and public finance"}],"texts":[{"doc_id":2834607,"date":"2023-07-18","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/US\/text\/HB4664\/id\/2834607","state_link":"https:\/\/www.congress.gov\/118\/bills\/hr4664\/BILLS-118hr4664rh.pdf","text_size":560417,"text_hash":"d22aed2f4d026c40db9334ec85f70846","alt_bill_text":0,"alt_mime":"","alt_mime_id":0,"alt_state_link":"","alt_text_size":0,"alt_text_hash":""}],"votes":[{"roll_call_id":1357391,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 623","yea":336,"nay":86,"nv":0,"absent":16,"total":438,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357391","state_link":"https:\/\/clerk.house.gov\/Votes\/2023623"},{"roll_call_id":1357392,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 624","yea":115,"nay":306,"nv":0,"absent":17,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357392","state_link":"https:\/\/clerk.house.gov\/Votes\/2023624"},{"roll_call_id":1357393,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 625","yea":187,"nay":238,"nv":0,"absent":13,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357393","state_link":"https:\/\/clerk.house.gov\/Votes\/2023625"},{"roll_call_id":1357394,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 626","yea":140,"nay":286,"nv":0,"absent":12,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357394","state_link":"https:\/\/clerk.house.gov\/Votes\/2023626"},{"roll_call_id":1357395,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 627","yea":183,"nay":246,"nv":0,"absent":9,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357395","state_link":"https:\/\/clerk.house.gov\/Votes\/2023627"},{"roll_call_id":1357396,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 628","yea":172,"nay":257,"nv":0,"absent":9,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357396","state_link":"https:\/\/clerk.house.gov\/Votes\/2023628"},{"roll_call_id":1357397,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 629","yea":250,"nay":174,"nv":0,"absent":14,"total":438,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357397","state_link":"https:\/\/clerk.house.gov\/Votes\/2023629"},{"roll_call_id":1357398,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 630","yea":219,"nay":210,"nv":0,"absent":9,"total":438,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357398","state_link":"https:\/\/clerk.house.gov\/Votes\/2023630"},{"roll_call_id":1357399,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 631","yea":205,"nay":220,"nv":0,"absent":13,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357399","state_link":"https:\/\/clerk.house.gov\/Votes\/2023631"},{"roll_call_id":1357400,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 632","yea":175,"nay":252,"nv":0,"absent":11,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357400","state_link":"https:\/\/clerk.house.gov\/Votes\/2023632"},{"roll_call_id":1357401,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 633","yea":106,"nay":322,"nv":0,"absent":10,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357401","state_link":"https:\/\/clerk.house.gov\/Votes\/2023633"},{"roll_call_id":1357402,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 634","yea":145,"nay":273,"nv":1,"absent":19,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357402","state_link":"https:\/\/clerk.house.gov\/Votes\/2023634"},{"roll_call_id":1357403,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 635","yea":205,"nay":211,"nv":0,"absent":22,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357403","state_link":"https:\/\/clerk.house.gov\/Votes\/2023635"},{"roll_call_id":1357404,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 636","yea":198,"nay":221,"nv":0,"absent":19,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357404","state_link":"https:\/\/clerk.house.gov\/Votes\/2023636"},{"roll_call_id":1357405,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 637","yea":196,"nay":223,"nv":0,"absent":19,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357405","state_link":"https:\/\/clerk.house.gov\/Votes\/2023637"},{"roll_call_id":1357406,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 638","yea":142,"nay":277,"nv":0,"absent":19,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357406","state_link":"https:\/\/clerk.house.gov\/Votes\/2023638"},{"roll_call_id":1357407,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 639","yea":208,"nay":212,"nv":0,"absent":18,"total":438,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357407","state_link":"https:\/\/clerk.house.gov\/Votes\/2023639"},{"roll_call_id":1357408,"date":"2023-11-08","desc":"On Agreeing to the Amendment RC# 640","yea":222,"nay":198,"nv":0,"absent":18,"total":438,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357408","state_link":"https:\/\/clerk.house.gov\/Votes\/2023640"},{"roll_call_id":1357409,"date":"2023-11-09","desc":"On Agreeing to the Amendment RC# 641","yea":165,"nay":257,"nv":1,"absent":16,"total":439,"passed":0,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357409","state_link":"https:\/\/clerk.house.gov\/Votes\/2023641"},{"roll_call_id":1357410,"date":"2023-11-09","desc":"On Agreeing to the Amendment RC# 642","yea":220,"nay":202,"nv":0,"absent":16,"total":438,"passed":1,"chamber":"H","chamber_id":114,"url":"https:\/\/legiscan.com\/US\/rollcall\/HB4664\/id\/1357410","state_link":"https:\/\/clerk.house.gov\/Votes\/2023642"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"event_hash":"c51c3488","type":"Hearing","date":"2023-11-06","time":"16:00","location":"H-313, CAPITOL","description":"House Committee on Rules Hearing"}]}}